{
  "chunk-42d1aecb9e99b337c4fa6b12891be5bc": {
    "tokens": 1200,
    "content": "Harris County Toll Road Authority\n## **HCTRA CUSTOMER SERVICE MANUAL**\n\nLast Updated:\nOctober 2022\n\nPrepared by:\nHCTRA Customer Service\nQuality Assurance and Training Section\n\n{page : 0}------------------------------------------------\n\n## **Disclaimer**\n\nPlease be advised that the HCTRA CSC (Customer Service Center) Manual receive modifications as needed by HCTRA CSC Management. Changes may occur in CSC policies, procedures, and processes that may not yet appear in the manual until the next modification schedule.\n\nTemporary processes, policies, and procedures may be activated to accommodate a system or staffing issue, and may not be present in the manual.\n\n{page : 1}------------------------------------------------\n\n# **New Hire Training Overview**\n\nWelcome to New Hire Training! Harris County Toll Road Authority (HCTRA) would like to take this opportunity to congratulate you on becoming a part of our professional staff, who are dedicated to serving the public.\n\nWe are excited to have you with us and we look forward to providing you with the information and tools needed to be successful on your career path with HCTRA! In the upcoming weeks, you will receive faceto-face interaction and computer based training that is designed to equip employees with the tools to perform daily job duties.\n\nThe New Hire Training process is divided into three specific phases:\n\n- Day in the Life Orientation Training-(1) One Day\n\t- o Job Training- (2) Two Days\n- Classroom Training Seven (7) days\n- Nesting Training Eight (8) days\n\nYou will be tested over the information covered throughout New Hire Training. The test will consist of multiple choice and true/false questions.\n\nAgain, congratulations on becoming a part of the HCTRA Family! We wish you the best of luck and look forward to working with you throughout the course of your career.\n\n*Quality Assurance and Training Staff*\n\n{page : 2}------------------------------------------------\n\n# **HCTRA Mission Statement**\n\n*\"HCTRA's mission is to responsibly operate and maintain a SAFE, RELIABLE, SUSTAINABLE AND EVOLVING mobility system that meets the diverse connectivity needs of all Harris County residents. \"*\n\n# **Customer Service Sections**\n\n# **Quality Assurance & Training (QA&T)**\n\n- Organizational development and training implementation\n- Quality monitoring\n- Career Development Training\n\n# **Call Center**\n\n- Assist customers via telephone\n# **Storefront**\n\n- Assist customers in person at any storefront location\n## **Back Office Services (BOS)**\n\n- Assist customers via email, large account call center and the fulfillment and distribution of EZ TAGs\n- IOP/Analytics\n- Correspondence EZ TAG and Violations\n\n# **Violation Enforcement Center (VECC)**\n\n- HCTRA Collections\n- Adjudication\n\n# **HCTRA Call Center**\n\n# **Customer Service Telephone Number is:**\n\n- 281-875-3279 (EASY)\n# **Call Center Hours:**\n\n- 7:00am 7:00pm Monday-Friday\n- 8:00am 4:30pm on Saturdays\n- Closed on Sunday\n\n# **HCTRA Violation Enforcement Collections Center**\n\n# **Violation Enforcement Collections Center:**\n\n- 713-701-6000\n- English queue #3225\n- Spanish queue #3226\n\n{page : 3}------------------------------------------------\n\n# **Incident Response Team**\n\nHCTRA Roads are kept clean and clear by IRT (Incident Response Team)\n\n- IRT patrols most HCTRA operated roads to assist motorists and clear road hazards\n- You do not have to be an EZ TAG customer\n- All IRT services are free of charge\n- IRT will help change tires, tow vehicles to the next exit, or provide enough gas to exit safely\n\n# **Training Expectations**\n\n# **While in training**\n\n- **Parking**\n- **Only** park in the assigned areas. Do not park in visitor or storefront areas.\n\n# **Training Objective**\n\nThe objective of this training course is to provide you with the knowledge and skills necessary to ensure the highest level of customer service for the Harris County Toll Road Authority (HCTRA). After successfully completing this course you will be able to:\n\n- Understand HCTRA history and policies & procedures\n- Provide professional customer service assistance for the Call Center, Storefront, Back Office, and VECC\n- Resolve customer concerns and complaints\n- Open new accounts, provide updates and close accounts\n- Process payments and resolve violations\n- Assist with other tolling agencies\n\n## **New Hire Training Outline**\n\n#### **Classroom Training**\n\nLearn about HCTRA Customer Service and all supporting tools in a discussion setting.\n\n{page : 4}------------------------------------------------\n\n- **8:00 am – 5:00 pm Monday through Friday.** Includes two (2) fifteen (15) minute breaks and a thirty (30) minute lunch.\n- Materials Needed:\n\t- o New Hire Training Manual & Handouts (provided by HCTRA)\n\t- o Driver's License or ID\n\t- o Earbuds or headphones that can be used in a computer\n- Quizzes are given daily.\n\n# **New Hire Nesting**\n\nUnder the supervision of Quality Assurance and Training staff, New Hires will receive live calls or assist walk-in customers in the storefront.\n\n- Materials Needed (provided by Training Team):\n\t- o Nesting Checklist\n\t- o Nesting manual and handouts\n\t- o Observation Report\n- All employees will report to the Training Center and work the same classroom hours\n\n# **Attendance**\n\nDue to the vast amount of information provided during training, absences are not permitted.\n\nIn the event you may be off schedule arriving to training, you **must** call and leave a message with the following:\n\n- Your name\n- Whether late or absent\n- Reason for the attendance issue\n\nPlease provide this number to any caregivers or as an emergency contact number only",
    "chunk_order_index": 0,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-ee1ef57a1ea0e469d20630b343cde71a": {
    "tokens": 1200,
    "content": "- o Observation Report\n- All employees will report to the Training Center and work the same classroom hours\n\n# **Attendance**\n\nDue to the vast amount of information provided during training, absences are not permitted.\n\nIn the event you may be off schedule arriving to training, you **must** call and leave a message with the following:\n\n- Your name\n- Whether late or absent\n- Reason for the attendance issue\n\nPlease provide this number to any caregivers or as an emergency contact number only for the duration of training.\n\n*Please take out your cell phones and save the training attendance line: Westside: 713-587-7732*\n\n*Note: Failure to leave a message is considered a no call / no show and will be reported to your agency! Contract employees must call their agency when an attendance issue occurs.*\n\n# **Training Objective**\n\nThe objective of this training course is to provide you with the knowledge and skills necessary to ensure the highest level of customer service for the Harris County Toll Road Authority (HCTRA). After successfully completing this course you will be able to:\n\n- Understand HCTRA history and policies & procedures\n- Provide professional customer service assistance for the Call Center, Storefront, Back Office, and VECC\n- Resolve customer concerns and complaints\n\n{page : 5}------------------------------------------------\n\n- Open new accounts, provide updates and close accounts\n- Process payments and resolve violations\n- Assist with other tolling agencies\n\n# **New Hire Training Outline**\n\n# **Classroom Training**\n\nLearn about HCTRA Customer Service and all supporting tools in a discussion setting.\n\n- **8:00 am – 4:30 pm.** Includes two (2) fifteen (15) minute breaks and a thirty (30) minute lunch.\n- Materials Needed:\n\t- o New Hire Training Manual & Handouts (provided by HCTRA)\n\t- o Driver's License or ID\n\t- o Earbuds or headphones that can be used in a computer\n- Quizzes are given daily.\n\n# **New Hire Nesting**\n\nUnder the supervision of Quality Assurance and Training staff, New Hires will receive live calls or assist walk-in customers in the storefront.\n\n- Materials Needed (provided by Training Team):\n\t- o Nesting Checklist\n\t- o Nesting manual and handouts\n\t- o Observation Report\n- All employees will report to the Training Center and work the same classroom hours\n\n# **Classroom Etiquette**\n\nDuring this class, it is important for all trainees to follow general training room etiquette. These rules will ensure that *your* learning is not hindered during the training process:\n\n- Respect instructors *and* trainees\n- Eating is not permitted in the training rooms\n- Restroom breaks may be taken as needed and sensibly\n- *Cell phones should be off*\n- Only access the programs you are told to access\n- No internet browsing using HCTRA computers\n- If you have a question, please raise your hand\n- Personal issues should be addressed discreetly with a trainer\n- Follow instructions and do not get ahead of the class\n\n# **Training Attendance Adherence**\n\nDue to the vast amount of information provided during training, absences/leaving early is **not** permitted\n\n{page : 6}------------------------------------------------\n\nIn the event you may be arriving late to training, you must call the attendance number **(713-587-7732)**  and leave a message with the following:\n\n- Your name\n- Reason for the attendance issue\n- Estimated time of arrival\n\n**Clearly state your name, the reason for calling and estimated time of arrival.**\n\n*Example: Hello, my name is Abigail Thornton I am a new hire in training. I am calling to let the someone know I will be 10 minutes late due to traffic on I-10.* \n\nPlease provide this phone number to any caregivers or as an emergency contact only for the duration of training.\n\n*Note:* \n\n- *Failure to leave a message is considered a no call / no show and will be reported to your agency!*\n- *Contract employees must call their agency when recording an attendance issue*\n\n# **HCTRA Customer Service Policies and Procedures**\n\n# **Clock-In & Clock-Out Procedures**\n\nAll employees are required to clock in and out utilizing the time clock, or NOVAtime.. Exceptions are made only if the time clock or NOVAtime is not functioning. Should one of these circumstances arise, the employee is required to write their shift start/end time on a piece of paper, initial it, and turn it into their supervisor or send an email to the designated personnel. Under no circumstances should an employee clock in/out for another employee.\n\nAll employees are required to be at their assigned workstation, prepared and ready to begin the day at their regularly scheduled time. Getting coffee, placing lunches in the refrigerator, going to the restroom, parking your car, etc., **must** be done before clocking in.\n\n# *Note: DO NOT clock out for breaks*\n\n# **Scheduled Break & Lunch Policy**\n\nAll employees working six hours or more will receive two, fifteen-minute breaks and one, thirty-minute lunch break. Break/lunch schedules have been assigned to all employees. Please make note of your scheduled time. Be prompt when leaving and returning from your break/lunch. Should you not be able to leave at your designated time, you must let your supervisor know.\n\nEmployees are **not** permitted to clock in early from lunch. You **must** take your full thirty-minute break.\n\nEating is not permitted at your workstations at any time. All drinks must be in a spill-proof container. Dtink/coffee custps purchased at local fast-food resturants are not allowed. Sprill proof custps with straws may be used for water only.\n\n{page : 7}------------------------------------------------\n\n# **Personal Cell Phone Policy**\n\n- Personal telephone calls should **only** be made on your break/lunch",
    "chunk_order_index": 1,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-c7b91213692237f56c6ea160f1466183": {
    "tokens": 1200,
    "content": "early from lunch. You **must** take your full thirty-minute break.\n\nEating is not permitted at your workstations at any time. All drinks must be in a spill-proof container. Dtink/coffee custps purchased at local fast-food resturants are not allowed. Sprill proof custps with straws may be used for water only.\n\n{page : 7}------------------------------------------------\n\n# **Personal Cell Phone Policy**\n\n- Personal telephone calls should **only** be made on your break/lunch time.\n- Emergency phone calls should be directed to your supervisor.\n- Personal cell phones **must** be silenced and placed in a concealed area.\n- Personal cell phone calls **cannot** be taken at your workstation.\n- Cell phone usage is **not** allowed in the restrooms.\n\n# **Tobacco Use Policy(PL0021)**\n\nThere is a ban on smoking in all Hrris County facilities. The same provisions apply for HCTRA employees who use smokeless tobacco and e-cigarettes(a.k.a.\"vaping\")\n\nAt no time will e-cigarette use, regardless of whether smoke is emitted be allowed inside any HCTRA facility or vehicle.\n\nSmoking is only permitted in outside designated areas.\n\n# **Employee's EZ TAG Account and Toll Processing Policy (PL0050)**\n\n- At no time shall any employee with access to the RITE 2.0 system make changes or updates to EZ TAG Accounts belonging to the CSR or family and friends.\n- At no time shall any employee with access to the RITE 2.0 system handle violations belonging to the CSR or family and friends.\n- All account transactions and toll violations should be handled by the employee on personal time via the website (www.hctra.org).\n\n• When online account updates are not possible, contact a person of management level or higher. *Note: You must identify yourself as a HCTRA employee.*\n\n# **Delinquent Unpaid Toll and EZ TAG Accounts Policy (PL0057)**\n\nViolations of HCTRA's tolling policies by having unpaid violations, outstanding EZ TAG violations with associated fees, or EZ TAG Accounts with a negative balance (monies owed), are incompatible with Toll Road employment. Such violations are contrary to HCTRA's standards of conduct and are considered to be mismanagement of an employee's position.\n\n{page : 8}------------------------------------------------\n\nRepeatedly and intentionally violating HCTRA's tolling policies by having unpaid violations, outstanding EZ TAG violations with associated fees and suspended EZ TAG Accounts with a negative balance (monies owed) is not only a civil violation and breach of the EZ TAG Agreement, but can also be prosecuted as a criminal offense (Texas Transportation Code § 284.070). An employee's continued disregard for HCTRA policy and state law will result in disciplinary action up to and including termination from employment.\n\n# **Dress Code Policy (PL0003)**\n\nAll employees are required to follow HCTRA's Dress Code Policy.\n\nEmployees must be aware of the impossibility of covering, by policy, every conceivable question on dress and grooming. Good judgment, consistent with acceptable professional business norms and safety, should serve as a basis for the measurement of personal dress, appearance, hygiene, and cleanliness. Employees should keep in mind the impression made on visitors, other employees, and business associates and dress accordingly. *Leggings are not acceptable*.\n\nRequest to deviate from this policy for medical reasons, religious reasons, or any other reason, must first be forwarded up the supervisory chain to the HCTRA Human Resources Section for a decision prior to the employee and/or supervisor or manager taking any action.\n\n# **Your Badge Must Be Worn at all Times**\n\n- Upon employment, a new HCTRA employee will be issued a photo identification badge.\n- The badge must be worn on the front of the outermost garment and the front of the badge must be clearly visible.\n- All badges should be worn at all times while on HCTRA property.\n- ID Badges **will not** be shared between individuals under any circumstances.\n\n# *If you lose your badge or see someone without a badge, notify a supervisor immediately!*\n\n*Please review the Dress Code Policy. Go to the \"Policy Section\" and sign the Acknowledgement Form.*\n\n# **HCTRA Building Security**\n\n- Piggybacking allows someone to follow you into a secure area from your badge scan.\n- Badges are to be worn in a visible area at all times\n- Never let someone in, even if you know him or her. They must call their supervisor for building entry and/or elevators\n- Never follow someone else in without scanning your badge\n\n# **HCTRANET Internal Website**\n\n{page : 9}------------------------------------------------\n\nHCTRANET [(http://hctranet)](http://hctranet/) is the employee resource website. Features available on HCTRANET include:\n\n- Employee Phone Numbers\n- I.T Self-Service\n- TranStar\n- Calendars\n- Employee Information\n- STARS\n- EZTime (Timesheet)\n- Lane Number Map\n- Toll Road Information\n- Harris County Website\n- HCTRA Policies and Procedures\n\n# **HCTRA.ORG-External Customer Website**\n\nwww.HCTRA.org is our customers' resource for account maintenance and HCTRA changes\n\n- Customers are able to perform the following:\n- Open new account\n- Make payment\n- Add/remove/update vehicles\n- Update billing information\n- Update contact information\n- Pay Violations\n- Access HCTRA news and information\n- And more!\n\n# **What is LearningZen?**\n\n- LearningZen is an online training platform that provides HCTRA employees with effective training.\n- LearningZen can be accessed from your desk.\n- Courses are scheduled as needed by QA&T, Supervisors, or Leads.\n- Do not advance through slides without reading the material for understanding.",
    "chunk_order_index": 2,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-7ced8aee0088fc618e65b70c0b1fac4f": {
    "tokens": 1200,
    "content": "- Add/remove/update vehicles\n- Update billing information\n- Update contact information\n- Pay Violations\n- Access HCTRA news and information\n- And more!\n\n# **What is LearningZen?**\n\n- LearningZen is an online training platform that provides HCTRA employees with effective training.\n- LearningZen can be accessed from your desk.\n- Courses are scheduled as needed by QA&T, Supervisors, or Leads.\n- Do not advance through slides without reading the material for understanding. Once you land on the quiz/test, you are locked in and will not be able to go back to view the material.\n\n# **The Student Experience**\n\n- If a course was not completed the day it was given, clicking Courses I need to Finish will allow the CSR to go back and continue the course.\n- The Courses I need to Start section will allow CSRs to view available courses that were assigned.\n\n{page : 10}------------------------------------------------\n\n- The Courses I've Taken section will allow CSRs to view completed courses and their Passed/Failed status. From this window, the CSR will be able to retake the course if necessary.\n# **Security & Safety Awareness**\n\n# **Sensitive Information**\n\nSensitive information HCTRA uses includes, but is not limited to the following:\n\n- Credit card numbers\n- EFT information (Bank Account)\n\nThese items are only allowed to be typed directly into designated RITE 2.0 text boxes and or triPOS credit card system. These items are not to be copied/pasted under any circumstances including account comments.\n\n# **What is Sensitive Information?**\n\n# **HCTRA does not use:**\n\n- Credit Card CVC numbers\n- Customer Social Security Number\n- Customer Date of Birth\n- Driver's License number (as of 5/7/22)\n\nHCTRA's IT section will **NEVER** ask for your\n\npassword. Alert a Lead immediately should anyone ask you for your password.\n\nHCTRA **PROHIBITS** CSRs from writing down any credit card or driver's license information outside of RITE 2.0/triPOS on the following.\n\n{page : 11}------------------------------------------------\n\n*Important: CSRs should inform the customer that their credit card number will be needed more than once due to security reasons. CSRs should never repeat the customer's credit card number!*\n\n# **Correct Masking**\n\nWhen masking payment information, follow the example below to ensure correct masking:\n\n# **Incorrect**: **Correct**:\n\n# **PCI Compliance**\n\n- We are not authorized to insert ANYTHING into our computer that is not HCTRA approved\n- Examples include: phone chargers, USB drives, CDs or external drives\n\n• Always lock your computer before leaving your work station.\n\n- o Press Windows key on the keyboard while pressing the letter L\n\n# **HCTRA Tolling Overview**\n\n**Texas Transportation Code 284**\n\n# **NONPAYMENT OF TOLL; OFFENSE:**\n\nA person commits an offense if the person:\n\n- Operates a vehicle on a county project and fails or refuses to pay a toll\nAn offense under this section is a misdemeanor punishable by a fine not to exceed $100\n\nThe county may take and retain possession of a vehicle operated in violation until the amount of the toll and all charges in connection with the toll are paid\n\n{page : 12}------------------------------------------------\n\n# **HCTRA Tolling Overview**\n\n# **Texas Transportation Code 284**\n\n# **NONPAYMENT OF TOLL; OFFENSE**\n\nA person commits an offense if the person:\n\n- Operates a vehicle on a county project and fails or refuses to pay a toll.\nAn offense under this section is a misdemeanor punishable by a fine not to exceed $100.\n\nThe county may take and retain possession of a vehicle operated in violation until the amount of the toll and all charges in connection with the toll are paid.\n\n# **HCTRA ROADS**\n\n- Every toll is accounted for.\n- Toll violators will be prosecuted.\n- Customers who use the toll road without an active Ez Tag account may drive through but must pay later.\n\n# **How EZ TAG Functions**\n\nAs drivers approach an EZ TAG lane, an electronic reader verifies the tag identification number. **IVIS**  then determines the axle count, and then the appropriate toll amount is automatically deducted from the customer's prepaid account.\n\n{page : 13}------------------------------------------------\n\n## **What is vehicle class?**\n\n#### **What is an Axle?**\n\nA rod or spindle (either fixed or rotating) passing through the center of a wheel or group of wheels.\n\n**Class 2 Vehicles (2 Axles)**\n\n**Class 3 Vehicles (3 Axles)**\n\n**Class 4 Vehicles (4 Axles)**\n\n{page : 14}------------------------------------------------\n\n**Class 5 Vehicles (5 Axles)**\n\n**Class 6 Vehicles (6 Axles)**\n\n# **Toll Rates by vehicle classification**\n\n** EZ TAG discounted rate only applies to two (2) axel vehicles.*\n\n# **HCTRA Lane Types**\n\n# **Lane Types & Payment Options**\n\nHCTRA facilities have the following lane types separated by payment method:\n\n**EZ TAG only: located to the far left are all electronic. Also known as AVI* lanes** \n\n{page : 15}------------------------------------------------\n\n**Manned Booth: In an effort to reduce the potential spread of the Coronavirus, HCTRA removed all cash handling from the toll lanes on March 11, 2020. Customers were directed to drive through the lanes and pay later. All tolls must be paid. Violators will be prosecuted**\n\n# **EZ TAG Only Lanes**\n\n- Our EZ TAG ONLY lanes are for motorists who have their vehicle registered with an approved toll agency.\n- Non-stop passage is allowed through these lanes, as tolls are electronically deducted from prepaid accounts via the toll tag or from the license plate.\n- All dedicated EZ TAG ONLY lanes are",
    "chunk_order_index": 3,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-c2e1604deb13a394d2a12fee77988020": {
    "tokens": 1200,
    "content": "lanes on March 11, 2020. Customers were directed to drive through the lanes and pay later. All tolls must be paid. Violators will be prosecuted**\n\n# **EZ TAG Only Lanes**\n\n- Our EZ TAG ONLY lanes are for motorists who have their vehicle registered with an approved toll agency.\n- Non-stop passage is allowed through these lanes, as tolls are electronically deducted from prepaid accounts via the toll tag or from the license plate.\n- All dedicated EZ TAG ONLY lanes are interoperable and some are designated with the TxTAG logo.\n\n# **Toll Roads & Mainlanes**\n\n# **Hardy Toll Road**\n\n# **Hardy Toll Road Facts**\n\n- Became EZ TAG only on July 18, 2016.\n- HCTRA's first toll road.\n- On and off ramps are marked by the closest major street.\n- Has the Airport Connector\n\n# **Mainlanes and Routes**\n\n- The Hardy Toll Road has 2 Mainlanes\n\t- o Hardy North EZ TAG Only\n\t- o Hardy South EZ TAG Only\n- Runs north and south bound and is located east of I-45 North.\n- Encompasses commuters who live in or near Spring, The Woodlands and Conroe.\n\n{page : 16}------------------------------------------------\n\n# **Westpark Tollway**\n\n# **Westpark Tollway Facts**\n\n- This is HCTRA's EZ TAG only toll road.\n- On and off ramps are marked by the closest major street.\n- It is owned by both Harris and Fort Bend Counties.\n\n## **Mainlanes and Routes**\n\n- Encompasses commuters who live in or near Mission Bend and Cinco Ranch.\n- Runs east and west bound from the 610 Loop to Grand Parkway 99.\n- Has two (2) Mainlanes\n\t- o Wilcrest Mainlane\n\t- o Fondren Mainlane\n\n# **Tomball Tollway**\n\n# **Tomball Tollway Facts**\n\n- This toll road is EZ TAG only.\n- On and off ramps are marked by the closest major street.\n- Shares ownership with TX TAG.\n\n# **Mainlanes and Routes**\n\n- Encompasses commuters who live in or near Magnolia and Tomball.\n- Located on Highway 249 between Spring Cypress Road and FM 2920.\n- Has only one Mainlane, known as North Pointe.\n\n# **Connecters, Extensions & Flyovers**\n\n- Airport Connector- Connects the Hardy Toll Road directly to George Bush Intercontinental Airport\n- Fort Bend Parkway Extension- Runs from US 90A in Harris County, stopping at the Fort Bend County line. EZ TAG only with one plaza\n- All connectors, extensions and flyovers are EZ TAG only\n\n# **Non-Tag Traffic Lanes**\n\n{page : 17}------------------------------------------------\n\n- All HCTRA lanes are equipped with devices which can capture license plates and record axle counts\n- Non-Tag customers are directed to use the Non-Tag Traffic lanes to the far right on the Toll road\n- Drivers of vehicles without tolling tags may pay their tolls online or in person at an EZ TAG store, by using their license plate number. If tolls are not paid before invoice generation, the customer will receive an invoice with additional fees\n- Non-Tag customers are encouraged to open an EZ TAG Account to enjoy the safest, most convenient toll road experience for the lowest rate\n\n# **All Electronic Tolling (AET)**\n\n- The Harris County Commissioners Court has approved an accelerated construction schedule to prepare for the all-electronic tolling conversion. By removing the narrow lanes on the Sam Houston Tollway, the commute on the toll will become faster and safer\n- The multi-year project will be scheduled and completed in phases to minimize the impact on traffic flow (scheduled for late nights and weekends)\n- These phases will allow HCTRA to limit the impact on neighbors who live or work near the plazas and keep the inconvenience to a minimum.\n\n# **Barrier- Free**\n\n- Until the toll plazas are removed, drivers with EZ TAGs will be directed to keep left, utilizing the 3 EZ TAG only lanes.\n- Drivers without EZ TAG accounts are directed to keep to the far right as they pass through the plazas at most locations. Although not required, drivers are encouraged to open an EZ TAG Account to receive additional discounts on tolls (EZ TAG rate, HCTRA EZ TAG Benefit\n- On Sam Houston toll plaza between Almeda Rd. and SH 288, all drivers including non-tag customers are asked to use the EZ TAG lanes currently, due to traffic volumes and constraints.\n- Over the next few years, toll plazas across the Sam Houston Tollway will be removed and replaced with the same kind of overhead all-electronic tolling equipment drivers currently see on other toll roads, including the Hardy Toll Road and Westpark Tollway. Tolls will not increase for drivers as a result of transitioning to the all-electronic tolling system\n\n# **Katy Managed Lanes**\n\n# **BACKGROUND**\n\n{page : 18}------------------------------------------------\n\n- This managed lane project is a result of a partnership between Harris County, the Texas Department of Transportation, the Federal Highway Administration and METRO\n- The toll road portion of the roadway was built with toll revenues, not tax dollars\n- HCTRA is charged with operating and maintaining the managed lanes\n\n*Please refer to Katy Managed Lanes Map and Rate Chart.*\n\n# **Katy Managed Lanes**\n\nBy making underused High Occupancy Vehicle (HOV) lanes available to Single Occupancy Vehicle (SOV) drivers who pay a toll, the new managed lanes could mean a more predictable trip for IH 10 commuters\n\nThese managed lanes:\n\n- Are free to carpoolers during HOV hours\n- Offer toll-paying Single Occupancy Vehicle (SOV) drivers a different commuting option\n- Free up space in the main lanes\n\n# **Katy Managed",
    "chunk_order_index": 4,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-73d9797aa9b9525a35b3a2f138718f0b": {
    "tokens": 1200,
    "content": "**Katy Managed Lanes**\n\nBy making underused High Occupancy Vehicle (HOV) lanes available to Single Occupancy Vehicle (SOV) drivers who pay a toll, the new managed lanes could mean a more predictable trip for IH 10 commuters\n\nThese managed lanes:\n\n- Are free to carpoolers during HOV hours\n- Offer toll-paying Single Occupancy Vehicle (SOV) drivers a different commuting option\n- Free up space in the main lanes\n\n# **Katy Managed Lanes Key Points**\n\n- Katy Managed Lanes ranges from Highway 6 to 610 Park-n-Ride.\n- KML HOV lanes are not available on weekends.\n- The HOV hours of Katy Managed Lanes are Mon Fri:\n\t- o 5:00 am 11:00 am & 2:00 pm 8:00 pm\n- Katy Managed Lanes have two lanes\n\t- o Lane one EZ TAG and IOP users only\n\t- o Lane two HOV users *(during time of day)*\n\n# **Katy Managed Lanes Rates**\n\nKaty Managed Lanes Peak Period Toll Rates\n\n{page : 19}------------------------------------------------\n\n# **Katy Managed Lanes Signage**\n\n- Signage is displayed when entering at Highway 6.\n- Signage is displayed at the entrance to the Katy Managed Lanes.\n- Signage is displayed on the Katy Managed Lanes.\n\t- o Left Lane is HOV Only\n\t- o Right Lane is EZ TAG Only\n- Signage is displayed at the tolling plaza.\n\n# **METRO HOT Lanes - February 2012**\n\nHouston's public transit system, METRO, launched a new HOV tolling lane system in February 2012.\n\n- METRO Hot Lanes Corridors are IH-45S and IH-45N, US 59S and US 59N, and US 290.\n- Lanes allow high-occupancy vehicles (HOV) and single-occupancy vehicles (SOV) to use lanes going in one direction at a time during certain times of the day. *(Times may vary)*\n- HOV drivers will receive **free** tolls. SOV drivers must pay a **toll** with their electronic toll tag.\n- The lanes do not accept cash payment.\n- These lanes are interoperable with **most** Texas electronic toll tags.\n\n# **SH-288 Express Toll Lanes**\n\nSH-288 Express Toll Lanes Facts\n\n- The SH-288 Express Toll Lanes project opened for free travel on Monday, November 16, 2020.\n- Tolling will begin on Monday, November 30, 2020.\n- The SH-288 toll project is an all-electronic (no cash) tollway, and is made up of two different entities:\n\t- o Blueridge Transportation Group (BTG), under partnership with TX DOT,\n\t- o Brazoria County Toll Road Authority (BCTRA).\n\n# **Mainlanes and Routes**\n\n- Blueridge Transportation Group (BTG) toll lanes north of the Brazoria County line\n\n{page : 20}------------------------------------------------\n\n- o It has four tolled lanes, two in each direction with the existing SH-288 median, from US-59 to Harris/Brazoria County Line\n- o Time-of-day pricing\n- Brazoria County (BCTRA) toll lanes south of the Brazoria County line\n\t- o Four toll lanes in the median between the main lanes of SH-288 from the Harris/Brazoria County Line to approximately County Road (CR) 58.\n\n# **Interoperability**\n\n# **Interoperability**\n\nin·ter·op·er·a·bil·i·ty ˌin(t)ərˌäp(ə)rəˈbilədē/ noun noun: interoperability\n\nthe ability of computer systems or software to exchange and make use of information\n\n- EZ TAGs will work on most Texas Toll Roads\n- Most Texas Toll Tags will work on HCTRA roads\n- We are now interoperable with Kansas and Oklahoma\n\n*HCTRA is working towards becoming interoperable nationwide*\n\n# **EZ TAG Interoperability**\n\n- EZ TAGs are interoperable on **most** Texas electronic tolling lanes; but not all FAQs online. Our tags are **not** interoperable on **cash-only** toll roads.\n- **EDUCATE!** Inform EZ TAG customers to contact the other agency prior to riding the toll road to confirm interoperability.\n- EZ TAG is interoperable with the METRO HOT Lanes.\n\n# **Interoperable Toll Roads in Texas**\n\n**State Highway 99**\n\n{page : 21}------------------------------------------------\n\nState Highway 99 (Grand Parkway), is a Texas highway, which opened its first section in 1994. Upon completion of State Highway 99, it will be the longest beltway in the U.S., and the third (outer) loop within the Houston–The Woodlands–Sugar Land area. The proposed 170-mile loop has been divided into 11 segments for construction and funding purposes.\n\n# **Additional facts:**\n\n- **All tolls are collected electronically**.\n- Customers must have a prepaid account using an EZ TAG, TX Tag, or NTTA Toll Tag.\n- Highway 99 is owned and managed by TX DOT.\n- Contains two tolling locations in each direction on each two-lane road.\n- Vehicles not operating with an active toll tag will be processed through the Texas Tollways violations process (per TX Tag).\n\n# **Interoperable Toll Road Agencies**\n\n# **Cameron County Regional Mobility Authority (CCRMA)**\n\n- Brownsville SH 550 -10-mile toll road provides an overpass of the Paredes Line Road FM1847 and a Union Pacific rail line\n# **North Texas Tollway Authority (NTTA)**\n\n-",
    "chunk_order_index": 5,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-7bcf3c550ec3a090ca8e0dcaf54d673d": {
    "tokens": 1200,
    "content": "direction on each two-lane road.\n- Vehicles not operating with an active toll tag will be processed through the Texas Tollways violations process (per TX Tag).\n\n# **Interoperable Toll Road Agencies**\n\n# **Cameron County Regional Mobility Authority (CCRMA)**\n\n- Brownsville SH 550 -10-mile toll road provides an overpass of the Paredes Line Road FM1847 and a Union Pacific rail line\n# **North Texas Tollway Authority (NTTA)**\n\n- Dallas/Fort Worth 32-mile, six-lane, limited access expressway passing through or along the cities of Dallas, Highland Park, University Park, Addison, Farmers Branch, Plano and Frisco\n# **Northeast Texas Regional Mobility Authority (NTRMA)**\n\n- Tyler includes Toll 49, US 59 Spur, George Richey Road Expansion, State Highway 149, Texarkana West Loop, I-20 Express Lanes, Loop 571\n# **Fort Bend County Toll Road Authority (FBCTRA)**\n\n- Fort Bend County Includes the 99 Grand Parkway Segment D from US 59 (S) to IH 10 (W) and Sienna Parkway to US 90A\n# **Toll Operations Division (TOD) Division of TX DOT**\n\n- Austin Loop 1, State Highway 45, State Highway 130\n- Laredo Camino Columbia) begins near the Colombia-Solidarity International Bridge and stretches 22 miles east to I-35 north of Laredo\n- (Tyler Tyler Outer Loop (nearing completion) offers drivers a fast-moving, convenient method of traveling around the south and west sides of Tyler, & quick access to Interstate 20\n\n# **Central Texas Regional Mobility Authority (CTRMA)**\n\n- Austin Road 183A is an 11.6-mile toll road located in northeast Austin **Kansas Turnpike Authority (KTA)**\n\t- Kansas- 236-mile route between the Kansas / Oklahoma border and Kansas City. KTA has electronic toll accounts and toll tags called K-TAG's**.**\n\n# **Oklahoma Turnpike Authority (Pike Pass)**\n\n{page : 22}------------------------------------------------\n\n- The Turnpike Authority Has provided the mechanism to fund the construction and maintenance of 606 miles of expressways for Oklahoma road users since 1953. PIKEPASS is the Electronic Toll Collection System (ETC) developed and implemented for the Oklahoma Turnpike System.\n# **Interoperability: Things to Remember**\n\n- In order to remain interoperable with approved agencies, customer accounts must remain in good standing.\n\t- o Must have a positive account balance\n\t- o Updated vehicle information\n\t- o Active EZ TAG\n- If a customer's account is not in good standing, they may receive violations from other agencies. Tolls will not post to their account.\n- Customers do not need multiple tags.\n\n{page : 23}------------------------------------------------\n\n# **HCTRA Non-Revenue Overview**\n\n# **Non-Revenue Usage Policy (PL0051)**\n\nBased on determinations made by the Commissioners Court, effective April 22, 2008, this policy allows free passage on the Harris County Toll Roads by determined vehicles and individuals using the toll roads.\n\nNon-Revenue motorist must follow the appropriate procedures for attaining free passage on the roads.\n\nThe vehicles allowed free passage are known as \"Non-Revenue\" vehicles or individuals.\n\n# **Types of Non-Revenue Vehicles**\n\n# **Non-Revenue Vehicles**\n\n- Authorized emergency vehicles identified in Texas Transportation Code §541.201. (amended time to time by the Texas Legislature)\n- Vehicles designated by the Department of Public Safety as emergency vehicles during disasters declared by the governor of Texas.\n- Processions and motorcades for heads-of-state and dignitaries if escorted by the United States Secret Service, Texas department of Public Safety, or other law enforcement.\n- HCTRA owned/leased vehicles performing County business.\n- Individual military vehicles and convoys. Clearly marked identifiable as military vehicles may use the electronic tolling lanes.\n\n{page : 24}------------------------------------------------\n\n- Vehicles part of a funeral procession are permitted free passage on the toll road system under these conditions:\n\t- o HCTRA is notified at least 24 hours in advance.\n\t- o HCTRA's Director determines it is in the interest of public safety that the procession be routed onto the toll road system.\n\t- o Certified peace officers escort the procession.\n\t- o The procession enters and exits the toll road Monday-Friday between 6:00am-9:00am or 4:00pm-7:00pm.\n\n# **Non-Revenue Individuals**\n\n- Current federal and state military members. (CSC-Procedure-Active Military)\n- HCTRA employees who *must* incur tolls to access their workstation.\n- HCTRA employees who must use the toll roads during their workday for HCTRA-related business in their private vehicles. Sign-in may be required.\n- Individuals with approved State of Texas Disabled Veteran license plate.\n- Includes Uniformed Services, but not limited to the following safety and security organizations:\n\t- o Armed forces\n\t- o Commissioned Corps of the National Oceanic and Atmospheric Administration\n\t- o Commissioned Corps of the Public Health Service\n\n# **Important Facts**\n\n- Non-revenue accounts are handled and maintained by Incident Management's Administrative Assistant.\n- When a customer has inquiries regarding their non-revenue accounts, please contact your **Lead**.\n- Tolls will **not** be refunded to non-revenue *individuals* if their EZ TAG Account was charged for usage after riding through a manned booth.\n\n{page : 25}------------------------------------------------\n\n# **Veteran Discount Tolling Program**\n\n# **General Information**\n\n- Effective December 18, 2009, eligible veterans receive free tolls on Harris County toll roads.",
    "chunk_order_index": 6,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-ed477ce5de8f18d998ea2cbea69698af": {
    "tokens": 1200,
    "content": "Assistant.\n- When a customer has inquiries regarding their non-revenue accounts, please contact your **Lead**.\n- Tolls will **not** be refunded to non-revenue *individuals* if their EZ TAG Account was charged for usage after riding through a manned booth.\n\n{page : 25}------------------------------------------------\n\n# **Veteran Discount Tolling Program**\n\n# **General Information**\n\n- Effective December 18, 2009, eligible veterans receive free tolls on Harris County toll roads.\n- Veterans must obtain a qualifying plate during their **vehicle registration** in order to receive the toll discount. Veteran plates are issued by the Texas Department of Motor Vehicles (TxDMV).\n- The following license plates are accepted (images on next slide):\n\t- o **Disabled Veteran**\n\t- o **Purple Heart Medal recipients**\n\t- o **Congressional Medal of Honor recipients**\n\t- o **Legion of Valor** ***** Effective September 1, 2013*\n- Eligible veterans with a vehicle registered with a specialty license plate, qualifies for free tolls when traveling through an EZ TAG lane on Harris County toll roads.\n- For zero dollar tolls for other agencies, eligible veterans must contact that agency before using their toll roads.\n\n# **Qualifying Veteran Plates**\n\n{page : 26}------------------------------------------------\n\n# **Eligible Participants**\n\n- Eligible vehicles will automatically receive the discounted toll rate in qualified tolling lanes through use of our imaging system. No additional action, purchase, or enrollment is required by the customer. By taking a picture when the customer drives through our lanes, we are able to view the qualifying plate and charge $0.00 toll rate.\n- If the eligible vehicle has an EZ TAG backed by an active EZ TAG Account, the customer may use any EZ TAG lane on the Harris County toll road system. This is not required.\n- If the eligible vehicle does not have an EZ TAG backed by an active EZ TAG Account, the customer may use any **non-gated** EZ TAG lane on the Harris County toll road system. Drivers will be electronically identified by their qualifying specialty license plate.\n\n# **Toll Declaration Form**\n\n- If the Veteran receives violations on a trailer being pulled by a vehicle with a qualifying Veteran plate, they may receive a waiver of fees and free tolls.\n- Qualifying customers must be escalated to a Supervisor/Lead to receive a Toll Declaration Form.\n- The \"Toll Declaration Form\" will be sent to the qualifying Veteran by a Supervisor or Lead through email, mail, or fax.\n- The customer will fax the completed form to 713-437-4147. The fees will be adjusted if applicable.\n\n- Make sure to leave comments!\n# **Things to Remember**\n\n{page : 27}------------------------------------------------\n\n- Qualifying Veterans will receive $0.00 tolls on Harris County toll roads through use of our imaging system or VET tag setting in RITE 2.0.\n- In order to qualify, Veterans must have one of the four (4) qualifying plates registered to their vehicle being driven on the toll roads.\n- The four qualifying plates are:\n\t- o Congressional Medal of Honor, Disabled Veteran, Purple Heart and Legion of Valor.\n- Veterans with qualifying license plates may be required to register their plates with non-HCTRA agencies.\n- Qualifying Veterans **do not** have to open an EZ TAG Account to receive free tolls.\n- Veterans who pull trailers will receive a fee adjustment/waiver if the vehicle with the qualifying plate was pulling the trailer. They must submit a **\"Toll Declaration Form**\" for the full amount to be adjusted to $0.00.\n\n# **RITE 2.0 Overview**\n\n{page : 28}------------------------------------------------\n\n#### NOW, log in to RITE 2.0\n\n• Your RITE 2.0 training credentials will be the same as your domain credentials. Please remember your login information and store it in a safe place.\n\n- If login is unsuccessful, check the following:\n\t- o Verify the spelling of your username.\n\t- o Ensure your [Num Lock] is on.\n\t- o Ensure your [Caps Lock] is not on.\n\t- o If login fails, inform the trainer. Do not attempt a second time!\n\n*Please alert a trainer if you experience any trouble.*\n\n## **RITE 2.0**\n\n- RITE 2.0 is what we use to assist customers.\n- RITE Common application is about us as CSRs.\n- The RITE CSC application is how we access customer accounts.\n- The applications available to you will depend on your role and job duties.\n\n# **HCTRA Account Types**\n\n#### **Account Types & Plans**\n\nAccounts are created for two (2) reasons:\n\n{page : 29}------------------------------------------------\n\n- The customer reached out to HCTRA to request an account.\n- The vehicle image was captured on the tollway and an account was generated.\n\n## *The type of accounts that the CSR will create and/or maintain will depend upon their job duties.*\n\n# **EZ TAG Account Types**\n\n## **Personal EZ TAG Account**\n\n- Prepaid account opened by a customer set to auto-charge\n- Funded by EFT (bank account), credit card, or debit card\n- EZ Plate only is an option\n\n# **Large EZ TAG Account**\n\n- Personal EZ TAG Accounts that include 20 or more active vehicles\n- May also be a Corporate, Invoiced or Fleet Account Type and Plan\n- Transfer large account customers to extension 3223.\n\n## **Personal Non-Revenue Account (Active Military)**\n\n- Personal Non-Revenue accounts created for active military individuals requesting free passage on HCTRA roads\n- Must be opened at a Storefront location\n\n## **Invoiced EZ TAG Account**\n\n- Prepaid account that charges the customer three times their monthly usage as the replenishment amount. When payment is received, the account",
    "chunk_order_index": 7,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-f4c9959d627ab1b30cb8d750c2980041": {
    "tokens": 1200,
    "content": "Corporate, Invoiced or Fleet Account Type and Plan\n- Transfer large account customers to extension 3223.\n\n## **Personal Non-Revenue Account (Active Military)**\n\n- Personal Non-Revenue accounts created for active military individuals requesting free passage on HCTRA roads\n- Must be opened at a Storefront location\n\n## **Invoiced EZ TAG Account**\n\n- Prepaid account that charges the customer three times their monthly usage as the replenishment amount. When payment is received, the account is replenished.\n- Established invoiced accounts converted to credit card or EFT cannot be reverted back to invoiced.\n- Transfer invoiced account customers to extension 3223.\n\n# **Fleet Accounts**\n\n- EZ TAG Accounts specially created to accommodate a large vehicle inventory.\n- These may include specialized upload features to input a large amount of vehicles at once.\n- If a customer is attempting to access or change a Fleet account, the CSR must transfer the call to BOS. Storefront CSRs will contact a Lead.\n\n#### *Fleet accounts are not to be updated or notated by CSRs!*\n\n#### **Account Plans**\n\n- **EZ TAG**: Customers who open an EZ TAG Account with HCTRA\n- **Violator**: Accounts generated from unpaid tolls and have registered vehicle information from the Department of Motor Vehicles (DMV)\n- **Shell**: Accounts generated from unpaid tolls and do not have registered vehicle information from the Department of Motor Vehicles (DMV)\n\n# **Processing a Payment in Rite 2.0**\n\n{page : 30}------------------------------------------------\n\n# **Accepting Credit Card information**\n\n- **Call Center Representatives** are responsible for verifying the card number twice, the name and the billing address on the card\n- **Storefront Representatives** triPOS will **not** automatically populate the card holder's name in the system once the customer has swiped the card. The storefront representative will be responsible for entering the name on the card into Rite 2.0. If the card holder's name does not match the customer's name and/or the card holder is not present with their ID, the card CANNOT be charged.\n- Never type the credit card number outside of triPOS terminal\n- Never repeat the customer's card information\n- Always verify payment amounts **BEFORE** asking customers to swipe card into triPOS or requesting the card information\n\n# **triPOS & NICE Recording System**\n\n- triPOS and NICE (HCTRA's call recording system) will work together to ensure that the customers card information is secured by muting the card number from the call recording. This also prevents the card number from being seen on the screen recording.\n- If the customer begins to provide the card number before you get to the secured credit card field, attempt to stop the customer by letting them know that the system is not ready. For security reasons, at no point should a customer credit card information be captured on a recorded line.\n- To ensure that CSR's remain PCI compliant, it is important that the following steps are followed.\n\n# **Adding a Credit Card Using triPOS**\n\n- 1. Select Credit Card from the drop down menu. If applicable (this options should only be selected if the customer confirms the billing information matches what is currently on file)\n- 2. Ask the customer if they have their credit card information ready before selecting **TypeIn CC**\n\t- a. In the event the customer begins to read off their credit card information before you select **TypeIn CC** politely interrupt the customer and inform them, for security reasons please allow you to get to the credit card screen.\n- 3. Select **TypeIn CC** from the \"TriPOS Add Credit Card\" pop-up.\n\n**Note**: Do not select **TypeIn CC** unless the customer is ready to provide you their credit card information. The TriPOS system times out within 1 minute of selecting **TypeIn CC**.\n\n# **Canceling a triPOS Transaction**\n\n- If the customer interjects while attempting to type in the credit card number, select the red \"**X**\" on the TriPOS to cancel transaction.\n- Next, select \"OK\" on the pop-up on your screen. See below.\n\n# **Violation Processing**\n\n# **Violation Enforcement System**\n\n{page : 31}------------------------------------------------\n\nOn January 23, 1996, the Harris County Commissioners Court ordered that effective February 1, 1996, no vehicle may be operated on any County toll project for which a toll or charge has been legally imposed if the operator has failed to pay a required toll or charge pursuant to section 284 of the Texas Transportation Code. As an action allowed by the approval of this order, the Toll Violation Enforcement section was established within the Harris County Toll Road Authority.\n\nThe Harris County Toll Road Authority is currently collecting toll violation images from 1238 cameras installed throughout the system. Rear Plate Cameras – 691 – two cameras per lane except for 1 lane at the bridge where we only have a single camera on a narrow shoulder. Front Plate Cameras – 547 – 2 cameras per AVI Only lanes except for 1 lane at the bridge where we only have a single camera on a narrow shoulder.\n\nOn average, 5.8 million toll violation events are captured by the system every month. The Toll Violation Enforcement section is currently reviewing 275K average reviews returned each day by Image Review and issuing an average of 91,667 Toll Violation Invoices per day.\n\nOn May 2, 2000, the Harris County Commissioners Court approved the adoption of an administrative adjudication hearing procedure for persons who failed to pay toll violation invoices received from the Toll Road Authority. The Toll Road Authority is currently working in partnership with the Harris County Attorney's Office and outside legal counsel to maintain the administrative hearing efforts. At least 800 cases per month are being presented in administrative hearings. Monthly, an average of 95 vehicle registration records are",
    "chunk_order_index": 8,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-06c63a82d989f192114e179782edcac5": {
    "tokens": 1200,
    "content": "Toll Violation Invoices per day.\n\nOn May 2, 2000, the Harris County Commissioners Court approved the adoption of an administrative adjudication hearing procedure for persons who failed to pay toll violation invoices received from the Toll Road Authority. The Toll Road Authority is currently working in partnership with the Harris County Attorney's Office and outside legal counsel to maintain the administrative hearing efforts. At least 800 cases per month are being presented in administrative hearings. Monthly, an average of 95 vehicle registration records are being flagged as \"scofflaw\" for failure to pay tolls as a result of this effort.\n\n## **What are Open Items?**\n\n- Open Items are outstanding items on a customer's account and there is an insufficient balance on the account.\n- The various sections of the **Open Items** screen are:\n\t- o Search\n\t- o Un-invoiced Transactions\n\t- o Account Fees\n\t- o EZ invoices\n\t- o Toll Violation Invoices\n\t- o Fingerprint Invoices\n\t- o Manned Booth Invoices\n\t- o Collection Invoices\n\t- o Payment Plan\n\t- o Open Item Actions\n\t- o Cart Summary\n\n# **Un-invoiced Transactions**\n\n- Un-invoiced tolls are unpaid tolls that HCTRA has not notified the customer about.\n- There are no additional fees added to the toll amount.\n- If the toll is not showing in the system, please advise the customer to check online and/or contact HCTRA within 72 hours.\n\n{page : 32}------------------------------------------------\n\n# **Paying Un-invoiced Transactions**\n\n- Select the checkbox next to the open items you want to add to the cart.\n- In the **Open Item Actions Bubble**, click \"**Add to Cart**\".\n- **Notice** all Open Items previously selected are now showing in the cart, ready for payment.\n- Click \"**Checkout**\" and proceed to the payment screen to resolve the selected open items.\n\n# **Account Fees**\n\n- Account Fees listed under Open Items are unresolved fees associated with the account, such as bounced check NSF fees.\n- In RITE 2.0, you may process all or selected fees.\n- Select the checkbox next to the item you want to add to the cart for payment.\n- In the Open Item Actions bubble, click \"**Add to Cart**\". Proceed with the payment.\n- Click **Checkout** and proceed to the payment screen to resolve te selected Open Items.\n\n# **Toll Violation Invoices (TVI)**\n\nFrom the Toll Violation Invoice screen, expand the plus sign on the Invoice to view the violation information\n\n- License plate number associated with the invoice\n- Invoice Number and Invoice amount\n- Mail date and Due date\n- Toll transaction date, time, location and amount\n- Fee date and amount\n- Tolling Agency\n\nClick on the invoice number to view DMV information and vehicle images.\n\n# **Violation Process**\n\n- **Administrative fee $7.00 or $10.00** The fee is due when a vehicle license plate has at least three (3) unpaid tolls which generate a violation invoice.\n- **County attorney fee $1.00** The fee is due when a vehicle license plate has at least three (3) unpaid tolls which generate a violation invoice.\n- **Collection fee $14.00 or $25.00** Referral to Collections is after 30 business days from the original due date of a violation invoice.\n\t- o **$14.00 collection fee (OLD)** is an additional fee for each unpaid toll or charge that is referred to the Collection Agency for collection services.\n\t- o **$25.00 collection fee (NEW)** is an additional fee for each unpaid violation invoice that is referred to Collections.\n\n# **HCTRA Prohibited Toll Violation Invoice**\n\n- Violations occur when a vehicle is using the toll road and does NOT PAY.\n\n{page : 33}------------------------------------------------\n\n- Once a violator has received a \"**Prohibited Invoice**\" they may be pulled over and issued a citation if they continue to use the toll roads.\n- Violation details are listed on the back of the invoice.\n- After at least three (3) unpaid tolls, HCTRA will mail a violation invoice via USPS to the registered owner of the vehicle at the registered address.\n\t- o **Toll: $X.XX**\n\t- o **Administrative Fee: $7.00**\n\t- o **County Attorney Fee: $1.00**\n- All invoices are considered a first and final notice. Each violation invoice has its own invoice number and due date.\n- When violations are not resolved by the due date, invoices will escalate to collections after 30 business days.\n\n# *Note: Prohibited means the vehicle is not allowed on any HCTRA toll roads.*\n\n# **Montgomery County Violation Invoice**\n\n- The Montgomery County Violation Invoice includes the same information and format as HCTRA.\n- $1.00 Agency Administrative Fee\n- $10.00 or $7.00 Administrative Fee\n\n# **BTG Violation Invoice**\n\nThe Blueridge Transportation Group (BTG) invoiced includes the same format as HCTRA. The original invoice includes tolls plus a\n\n- $1.15 Mailing Fee\n# **Collection Invoices**\n\nFrom the Collection Invoices screen, expand the Invoice to view the violation information\n\n- License plate number associated with the invoice\n- Invoice Number and Invoice amount\n- Escalation state\n- Mail date and Due date\n- Toll transaction date, time, location and amount\n- Fee date and amount\n- Tolling Agency\n\n{page : 34}------------------------------------------------\n\nClick on the invoice number to view DMV information and vehicle images.\n\n# **COVID-19 Update**\n\n#### **Toll Violation Invoices – Zero Fees**\n\nHCTRA is issuing (",
    "chunk_order_index": 9,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-7e437ef662863633c256e063daca0800": {
    "tokens": 1200,
    "content": "violation information\n\n- License plate number associated with the invoice\n- Invoice Number and Invoice amount\n- Escalation state\n- Mail date and Due date\n- Toll transaction date, time, location and amount\n- Fee date and amount\n- Tolling Agency\n\n{page : 34}------------------------------------------------\n\nClick on the invoice number to view DMV information and vehicle images.\n\n# **COVID-19 Update**\n\n#### **Toll Violation Invoices – Zero Fees**\n\nHCTRA is issuing (TVZ- Toll Violation Zero Fee) for unpaid toll transactions with no fees. These TVZs look, feel and behave similarly to that of the traditional Toll Violation Invoice (TVI).\n\n- A TVZ can include up to 25 toll violation events.\n- If a customer is paying for a TVZ only, no additional fees will be added.\n- A Fee Reduction or Adjustment cannot be performed on a TVZ invoice.\n\n{page : 35}------------------------------------------------\n\nExpand on the Toll Violation Invoice. Notice this is a TVZ invoice. No additional fees have been added at this time.\n\n*RITE will not allow FRP on TVZ invoices only. Items can be added directly to Cart for payment.* \n\n{page : 36}------------------------------------------------\n\n# **(TVF)Toll Violation Invoices- One Dollar Fine**\n\n- Starting March 1, 2021, a new toll invoice will be mailed to customers.\n- This new toll invoice will give the customer 30 days to pay unpaid tolls with no additional fees.\n- After the due date, on day 31, a fine of $1.00 per transaction will be assessed if not paid by the due date shown, for tolls incurred after February 28, 2021.\n- This fee is due in full, no adjustments can be applied.\n\n# **Fingerprint Invoice**\n\nFingerprint invoices are sent to owners of vehicles with obstructed plates who have violations.\n\n# **Open Item Actions**\n\n- The Open Item Actions section allows you to take action on the selected un-invoiced transactions, invoices, and account fees.\n# **EZ Invoicing**\n\nEffective September 5, 2023, HCTRA's previous violation process was replaced with a new EZ Invoice, which combines:\n\n- The Current Billing Cycle,\n- Previous Billing Cycle and,\n- Collection Invoices in a single notice\n\n{page : 37}------------------------------------------------\n\n# **EZ Invoicing**\n\n- The EZ invoice is generated once the customer has 3 unpaid transactions within a 25-day billing cycle.\n- The County Fine will be included in the Toll Rate (2x the EZ Tag Rate)\n\n*For Example:* If the EZ Tag Rate for a 2-Axle vehicle is $1.50.\n\n($1.50 EZ Tag Rate x 2 = $3.00 Toll Rate )\n\n*Metro transactions will have the $1.00 County Fine listed apart from the toll in Rite 2.0.\n\n- Notice 1 will include a $10.00 EZ Invoice Notice (EIN) Administrative Fee\n- Notice 2 will include the previous balance with no additional fees and any unpaid tolls that occurred within the 25-day billing cycle but were not posted at the time Notice 1 was generated\n- EZ Tag customers qualify for 2 Fee Reductions within a 365-day period, per license plate. Non-EZ Tag customers qualify for 1 Fee Reduction within a 365-day period, per license plate.\n\n# *Violations from other agencies that are managed by HCTRA will not be included in the EZ Invoice*\n\n# **HCTRA EZ Invoice**\n\nHCTRA EZ Invoice will consist of:\n\n- Balance Due\n- Payment Due\n- Mail Date\n- EZ invoice Number\n- License Plate\n- Previous Balance\n- Payments\n- Adjustments\n- Current Tolls\n- Fees\n\n{page : 38}------------------------------------------------\n\n- The Current Billing Cycle includes unpaid transactions that occurred within the 25-day billing cycle, from the date of the first unpaid transaction\n- A County Fine will be included in the Toll Rate (2x the EZ Tag Rate) and a $10.00 EIN Administrative Fee will be added to the bill\n- If the balance is not paid in full prior to the due date, the customer will then receive Notice 2 which will include the previous balance Notice 1 was generated, with no additional fees and any unpaid tolls that occurred within the 25-day billing cycle but were not posted at the time\n- Account Fees will only be added to the EZ Invoice for unregistered accounts\n\nThe Open Items Screen will now display an EZ Invoice section which will include:\n\n- EZ Invoice Number\n- License Plate #\n\n{page : 39}------------------------------------------------\n\n- Transaction From Date\n- Transaction To Date\n- EZ Invoice Amount\n- EZ Invoice Paid/Adjusted Amount\n- EZ Invoice Balance Due\n- EZ Invoice Created Date\n- EZ Invoice Due Date\n- EZ invoice Mail Date\n- Returned Mail\n\nExpan on the EZ invoice to view the following violation details:\n\n- Current Billing Cycle-Transactions that occurred within the 25-day billing cycle\n- Previous Billing Cycle- Past due invoices\n- Collection Invoices- Invoices that are 60 days old\n- Past Unpaid Transactions Transactions that have failed to invoice for whatever reason. May include older transactions, IOP transactions, transactions that posted as AVI.\n- Account Fees (displayed only for unregistered accounts)- Other fees such as NSF (Insufficient Funds) Fees\n\n{page : 40}------------------------------------------------\n\n#### **Invoice Fees**\n\nTVI Invoices\n\n- Generated after 3 unpaid tolls\n- $10.00 or $7.00 Administrative Fee per each transaction\n- $1.00 County Attorney Fee per each transaction\n- Collection Fees are $14.00 per transaction or $25.00 per invoice\n\n# TVZ In",
    "chunk_order_index": 10,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-613936b1c07669b324a719f22b1b3988": {
    "tokens": 1200,
    "content": "Account Fees (displayed only for unregistered accounts)- Other fees such as NSF (Insufficient Funds) Fees\n\n{page : 40}------------------------------------------------\n\n#### **Invoice Fees**\n\nTVI Invoices\n\n- Generated after 3 unpaid tolls\n- $10.00 or $7.00 Administrative Fee per each transaction\n- $1.00 County Attorney Fee per each transaction\n- Collection Fees are $14.00 per transaction or $25.00 per invoice\n\n# TVZ Invoices\n\n- Generated after 3 unpaid tolls. Can include up to 25 unpaid tolls\n- No Administrative Fee\n- $1.00 County Fine per each transaction (after 31 days from the Mail Date)\n- $10.00 Collection Fee per invoice\n\n# EZ Invoices\n\n- Generated after 3 unpaid tolls. Can include up to 25 unpaid tolls\n- $10.00 EIN Administrative Fee per invoice\n- $10.0 Collection Fee per invoice\n\n*Note: County Fine is included in the toll rate*\n\n# **Hearing Process**\n\n**For unpaid invoices, the following steps take place:**\n\n{page : 41}------------------------------------------------\n\n- 1. The collection department prepares and mails a series of demand letters and makes attempts to contact the toll violator by telephone.\n- 2. If payment is not received within sixty days after the collection agency's efforts have taken place and if the toll violator is eligible for an Administrative Hearing, an additional fee is added to the outstanding amount and a hearing is scheduled.\n- 3. During the Administrative Hearing process a judge will listen to arguments presented by the Toll Road Authority and by the toll violator and issue an Order of Judgment. The Order of Judgment will indicate the Judge's ruling and determine the final amount due. As a part of the ruling, the Judge has the option to assess additional fines and costs, flag (block) the vehicle registration, or place a device (boot) on the vehicle prohibiting movement until the outstanding tolls and fees are paid.\n- 4. If payment for tolls, charges, fees or costs is not received within thirty-one days of the hearing decision being filed with the County Clerk's office, registration of the vehicle will be blocked.\n\n# *Note: Failure to appear at the hearing is considered an admission of liability and the hearing officer may issue an order assessing a fine and costs on that basis.*\n\n# **Excusals**\n\n- Excusals reduce the amount of money that is collected from the customer.\n\t- o Certain types of excusals are performed on Open Items such as **Adjustments** and **Waivers**\n- Adjustments are used to reduce a percentage of the fee.\n- Waivers are used to remove County and Administrative fees.\n- The excusal type drives the available excusal reasons.\n\t- o The total fields at the top are greyed out and are automatically calculated by the system based on the items selected for the excusal.\n\n# **Violations Fee Waiver Reduction Policy**\n\n# **Fee Reduction**\n\nWhat is the Fee Reduction Policy?\n\n- HCTRA's Fee Reduction Policy went into effect January 1, 2016.\n- Fee Reduction Policy has been revised as of September 2023\n- •\n- Fee Reduction Script and/or signed acknowledgement is required before processing.\n\n# **Fee Reduction Program**\n\nHCTRA's Fee Reduction Program (FRP) allows a fee reduction per license plate. EZ TAG account holders can utilize this program twice within a 365-day period, while Violator accounts are eligible for the program once within the same timeframe.\n\n# *Note: If the fee reduction is applicable, offer it to the customer.*\n\n{page : 42}------------------------------------------------\n\n# **How to Perform a Fee Reduction**\n\n- Select the checkbox next to the invoices the customer qualifies to have waived.\n- Click \"**Excuse**\" from the Open Item Actions section.\n- From the Excusal screen, select Excusal Type \"**WAIVERS**\", Excusal Reason \"**FEE REDUCTION PROGRAM**\", then click \"**Add to Cart for Excusal**\".\n- Type in \"offered fee reduction program\" in the comments box and click ok.\n- Notice the green message indicates the excusal has been successfully added to the cart, ready for payment.\n- Before checking out, please ensure all uninvoiced tolls have been added to the cart.\n- Select \"**Checkout**\" to proceed to the payment screen.\n- Select the appropriate Payment Delivery option from drop-down.\n- Click \"**Add**\" and then \"**Checkout**\" to complete the payment process.\n\n## **Fee Reduction**\n\n- Aside from taking Fee Reduction payments in RITE 2.0, customer's now have the option of paying by check through USPS mail.\n- In the event a customer request to mail in a check for a Fee Reduction (FRP) offered by a CSR, the customer needs to send a piece of correspondence to indicate that. The CSR has the option of providing (via email or storefront) the Fee Reduction Program Mail-In Form to the customer\n\n*Note: This FRP mail-in option is only available for customers whose license plate has 15 or less TVI's*\n\n# **Adjustments**\n\n- Adjustments are another way to reduce the invoiced amount.\n- Reasons for adjustments may vary.\n- Some adjustments may require Lead and/or Supervisor approval.\n\n# **Common Reasons for Adjustments**\n\n#### **To Be Mailed Invoices**\n\nTo Be Mailed invoices indicate the system has generated an Invoice for the customer, however HCTRA has not mailed it out.\n\n- If the Mail Date and Due Date read \"To Be Mailed\", offer 100% Adjustment.\n#### **Future Dated Invoicing**\n\n{page : 43}------------------------------------------------\n\nFuture Dated Invoicing occurs when the invoice date has yet to approach the present calendar date. If it is determined, the",
    "chunk_order_index": 11,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-8d657ce97fbc95544c81a7727027363b": {
    "tokens": 1200,
    "content": "**\n\n#### **To Be Mailed Invoices**\n\nTo Be Mailed invoices indicate the system has generated an Invoice for the customer, however HCTRA has not mailed it out.\n\n- If the Mail Date and Due Date read \"To Be Mailed\", offer 100% Adjustment.\n#### **Future Dated Invoicing**\n\n{page : 43}------------------------------------------------\n\nFuture Dated Invoicing occurs when the invoice date has yet to approach the present calendar date. If it is determined, the invoice is future dated, offer 100% adjustment.\n\n# **Delayed Invoice:**\n\n- When researching violation invoices, we must determine at least one violation event occurred within 30 days of the date the invoice was mailed.\n- If one transaction is within the 30 days, then the invoice is not considered to be delayed.\n- If it is determined the invoice was delayed, offer 100% adjustment.\n\n# **Continuation Fee Reduction**\n\n- Violations that were not addressed during a previous Fee reduction may qualify for a continuation.\n- Please check the transaction date and time to ensure the violations occurred prior to the date and time of the previous Fee Reduction.\n- Continuation Fee Reduction should not exceed maximum allowed 15 invoices per the Fee Reduction Policy.\n- If it is determined the invoice is a part of a continuation fee reduction, offer a 100% adjustment.\n\n# **Performing a 100% Adjustment**\n\n- 1. Click on \"Open Items\".\n- 2. Select the items/fees to remove and click Excuse.\n- 3. For Excusal Type and Reason, select ADJUSTMENTS.\n- 4. The violation fees will be broken down per county by Administrative Fee, Collection Fee, and County Attorney Fee. Two options are available to adjust:\n\t- i. Adjust by Percentage (%)\n\t- ii. Amount to be Adjusted ($)\n- 5. Enter the percentage or amont to be adjusted, select DISCOUNT from the Excusal Reason dropdown, and click Add to Cart for Excusal.\n- 6. In the Confirmation pop-up, confirm the original balance selected, the fees that are to be adjusted, and the total payment amount to collect. If the amount is correct, click YES and add to cart.\n- 7. Enter appropriate comments in the Comment pop-up, and click OK.\n- 8. Total Payment Due will be added to the cart. Proceed with processing the payment.\n\n# **HCTRA Invoice Resolution Matrix**\n\nBefore we request payment for any toll violation invoices, we are required to review violations to verify if the invoice qualifies for an adjustment of fees. This applies to both collections and non-collections invoices.\n\n{page : 44}------------------------------------------------\n\n# **Adjusting Specific Fees**\n\nPerform the following steps when adjusting specific fees in order to process a payment for the remaining balance.\n\n- 1. Click on Open Items\n- 2. Select the checkbox next to the invoices that qualify for an adjustment. Scroll down and click Excuse.\n- 3. From the Excusal Screen, Select Adjustment for the Excusal Type and Discount for the Excusal Reason. Select the applicable Discount Reason from the drop-down selection.\n- Corrective Action is Taken\n- Discretionary adjustment\n- EZ-Tag Conversion\n- *Other\n- Scheduled for Hearing\n\t- a. Selecting \"OTHER\" will require you to manually enter the adjustment percentages.\n- 4. After selecting the applicable Discount Reason, the system will automatically apply percentages and the boxes will be greyed out.\n- 5. Select \"Add to Cart for Excusal\"\n\t- *a. Note: The standard adjustment comment is auto-populated in the Add to cart for excusal Confirmation pop-up. Select Yes. Complete in missing information needed for your comment and select \"OK\".*\n\n{page : 45}------------------------------------------------\n\nTotal Payment Due will be added to the cart. Proceed with processing the payment.\n\n## **EZ-Tag Conversion Adjustment steps:**\n\nStep 1:\n\n- Excusal Type: Adjustment\n- Excusal Reason: Discount\n- Discount Reason: EZ-TAG CONVERSION\n\nSelect \"Yes\" to continue\n\n# **Step 2:**\n\nSelect \"Convert to EZTag\"\n\n# **Step 3:**\n\nSelect \"Yes\" on Add to cart for excusal Confirmation\n\n{page : 46}------------------------------------------------\n\n# **Step 4:**\n\nComplete any missing information needed for your comment and select \"OK\".\n\n# **Step 5:**\n\nThe system will take you through the New Account setup Wizard. Select \"EZ TAG\" for the Account Plan and complete the mandatory fields.\n\n# **Step 6:**\n\nFrom the Vehicle Setup screen, select \"Request/Add Tag\". Complete the transponder request.\n\n{page : 47}------------------------------------------------\n\nClick, \"Save\", and then \"Next\"\n\n**Step 7:** Add the customer's Billing Information and drop the card underneath Billing Preferences.\n\n**Step 8:** Add any additional authorized contact persons, if applicable. Select Next.\n\n**Step 9:** Confirm Notification Preferences. Select Next.\n\n**Step 10:** Confirm Autocharge amount\n\nPlease go over the confirmation page with the customer. If there are no necessary changes, please proceed by selecting \"Next.\"\n\n**Step 11:** The Cart Summary will display the adjusted amount, plus the new account cost. Select, \"Checkout\" and proceed with processing the payment .\n\n## **Adjustment Important things to remember**\n\nThe system will automatically apply 100% adjustment on Delayed-Invoices.\n\nPlease take note of the important red alert, which serves as a reminder that discounts cannot be applied to Collection Invoices related to BTG/BCTRA/MCTRA.\n\nYou will also find contact information for their collection agency included.\n\n# **Invoice Reissuance**\n\n- When a TVI is returned and reissued, a new version will be created.\n- Version 1 of the invoice is always mailed to the registration",
    "chunk_order_index": 12,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-cb95b9be3caa77c31c0b0a5d9fcdb30b": {
    "tokens": 1200,
    "content": "**\n\nThe system will automatically apply 100% adjustment on Delayed-Invoices.\n\nPlease take note of the important red alert, which serves as a reminder that discounts cannot be applied to Collection Invoices related to BTG/BCTRA/MCTRA.\n\nYou will also find contact information for their collection agency included.\n\n# **Invoice Reissuance**\n\n- When a TVI is returned and reissued, a new version will be created.\n- Version 1 of the invoice is always mailed to the registration address with the DMV.\n- Additional versions of the invoice can be reissued and sent to a different address used sources such as Skip Trace, DMV, E-Tag Source.\n\n48 | P a g e\n\n{page : 48}------------------------------------------------\n\n# **Skip Tracing**\n\nSkip tracing is the process of searching for a different, sometimes better address. HCTRA's Skip Tracing vendor is tasked with searching for a better address if a TVI is returned as a Bad Address.\n\n- If the Violator Account has been flagged with the bad Address Alert, Skip Tracing occurs on the 31st day from the original Mail Date.\n- If a new address is located, the invoice is then reissued with a new mail date and due date.\n- If HCTRA is unable to locate another address, the invoice escalates to Collections\n- **Paying Tolls & Invoices Online**\n- When a customer enters their license plate on hctra.org to pay their tolls and invoices, the website will return \"everything owed\".\n\n- The customer will see all un-invoiced transactions, invoices, open payment plan alerts, as well as other plates with an outstanding balance that may be on the same EZ TAG account. The customer will be able to manually select which items they would like to pay and for how much\n- If the customer searches on License Plate only, invoice numbers will be masked.\n- When the customer enters license plate and invoice number, full invoice numbers will display for all invoices that are on the same account in RITE. Any invoices from a different account in RITE will be masked for privacy reasons. The other account(s) could belong to someone else.\n- A customer is allowed to partially pay an invoice, but an invoice must be paid in its entirety to be eligible for any applicable discount.\n\n{page : 49}------------------------------------------------\n\n- The Discount amount will decrease when items are unselected or when only partial payment is being made for an \"eligible-for-adjustment\" invoice.\n# **Pay on Shell Account**\n\n# **Pay on Shell Account**\n\n- 1. Locate the account.\n- 2. Click **No** (Would you like to continue with account setup?).\n- 3. Click **Yes** (Do you want to make a payment on a Shell Violator Account?).\n- 4. The system will now allow to process the payment.\n\t- a. Select the desired tolls and click **Add to Cart**.\n\t- b. Click **Checkout** or you can opt to Pay Using EZ TAG Account.\n- 5. Continue the checkout process.\n\n# **Court Dates and DMV Holds**\n\n- Collections Invoices with \"Adjudication\" in the Escalation Date have a court date. These customers may contact to the Violation Enforcement Collections Center at 713-701-6000.\n- The Registration Hold Status will display \"On Hold Registration\" in the Vehicles Details screen if there is a DMV Hold. Contact your Lead if your customer has a DMV Hold.\n\n# **Payment Plans**\n\nQualifications for a payment plan:\n\n- Balance due is $200 or more after calculating invoices that qualify for 100% adjustment:\n\t- o Ex: future dated/to be mailed/delayed invoices, HCTRA error, or continuations\n- A court hearing has NOT been scheduled or missed.\n\t- o If a hearing has been scheduled or missed, the customer MUST be transferred to the VECC at extension 3225.\n- The customer has not defaulted on a previous payment plan for the same balance.\n\n# **Requesting a Payment Plan**\n\nCustomers with violations may qualify for a payment plan, if applicable. The customer must have violations of at least $200 and they are unable to make full payment.\n\nIf the customer meets these qualifications, please use your section's standard procedures.\n\n- Call Center/BOS: Email the pertinent information to your leadership team.\n\n{page : 50}------------------------------------------------\n\n- Storefront: Email pertinent information to your management team.\nFor DMV Release Letter, please contact your Lead.\n\n*NOTE: At no point during the conversation should CSRs attempt to discuss payment plan terms or amounts with the customer!*\n\n# **Processing a Payment Installment**\n\n- To process a payment on a **Payment Plan**, from the **Payment Plan** section select the items you want to pay.\n- In the **Open Item Actions** section, click \"**Add to Cart**\". o Notice the items were added to the **Cart Summary**.\n- Proceed to checkout and complete the payment process.\n\n# **Payment Plans (online)**\n\nIn addition to processing a payment on a payment plan installment with a CSR, customers also have the option to process a payment on a payment plan installment online at [www.hctra.org.](http://www.hctra.org/)\n\n# **Vehicle Release of Liability**\n\n#### **Vehicle Sold Procedures**\n\n#### **Call Center CSR Procedure:**\n\nIf a customer calls regarding violations on a vehicle that was not in their possession, Call Center CSRs must:\n\n- Instruct the customer to fax proper documentation to e-fax (713-437-4147) or email to [csc](mailto:csc-correspondence@hctra.org)[correspondence@hctra.org.](mailto:csc-correspondence@hctra.org)\n- Enter notes in RITE 2.0 describing the customer encounter.\n\n# *",
    "chunk_order_index": 13,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-61f9e69d863aaeb9fea37638aba8c3fb": {
    "tokens": 1200,
    "content": "a customer calls regarding violations on a vehicle that was not in their possession, Call Center CSRs must:\n\n- Instruct the customer to fax proper documentation to e-fax (713-437-4147) or email to [csc](mailto:csc-correspondence@hctra.org)[correspondence@hctra.org.](mailto:csc-correspondence@hctra.org)\n- Enter notes in RITE 2.0 describing the customer encounter.\n\n# *Your Lead or Supervisor will complete the \"Vehicle Sold\" once the documentation has been received.*\n\n# **Storefront Procedure:**\n\n- Inform the customer they must provide proper documentation.\n\t- o If received, ensure documentation is legible.\n- Consult Lead/Supervisor to view all documentation.\n- Enter notes in RITE 2.0 describing customer encounter.\n\n{page : 51}------------------------------------------------\n\n## **Proper Documentation**\n\nA customer may not be liable for violations, for reasons including, but not limited to, the following:\n\n- Sold\n- Traded\n- Given to Charity\n- Stolen\n- Salvaged\n\nThe customer must submit proper documentation in order for the violations to be dismissed (based on the date possession of the vehicle was relinquished).\n\n## **Proper documentation includes, but is not limited to, the following**:\n\n- Copy of Texas Motor Vehicle Transfer (must be confirmation form)\n- Copy of Bill of Sale (must have signatures from both parties)\n- Copy of Title\n\n## *Note: Documentation cannot be provided after payment. Refunds will not be given.*\n\n{page : 52}------------------------------------------------\n\n# **HCTRA EZ TAG Agreement**\n\n# **EZ TAG Applicants**\n\n- Customers may only open accounts in their own names.\n- All negative balances must be paid before opening a new account.\n- CSRs may only open personal EZ TAG Accounts.\n- Customers may have multiple EZ TAG Accounts as long as they are all in good standing.\n\n# **Cash in EZ TAG Stores**\n\nCash can be used to maintain a pre-paid account balance.\n\nCustomers can now pay with cash at all EZ TAG Store locations. They can add funds to their account balance, pay invoices, and make \"payment plan installment\" payments. Anything that can be paid using credit/debit card and bank account, can be paid using cash. There is no minimum for cash payments.\n\n# **EZ TAG Options**\n\n# **EZ TAG Facts**\n\nHCTRA uses RFID (Radio Frequency Identification) based **transponders**. We call these **EZ TAGs**.\n\n- **EZ TAGs** have their own unique number that appears as \"**HCTR**\".\n- **EZ TAGs** must be assigned to a specific plate to ensure accuracy in toll payments.\n- **EZ TAG** scans are not guaranteed; customers must ensure the license plate is updated before using the toll road.\n- **EZ TAGs** can be picked up in a store or mailed to the customer.\n\t- o **EZ TAGs** that are mailed *must* be activated by the customer.\n\t- o If a customer selects \"pick up\", they have 14 business days to pick it up or the tag is automatically mailed out.\n\n# **EGO EZ Tag Installation Instructions**\n\n- Every customer is provided with a kit that includes the \"QUICK START EZ TAG INSTALLATION INSTRUCTIONS.\"\n- Please review this section to be aware of the information provided to the customer.\n- CSR's are not permitted to advise the customers against the provided instructions.\n- Regardless of how many tags a customer may have, any time we give a customer an EZ TAG, we must provide them with instructions.\n\n# **The EGO PLUS REGULAR**\n\n- The **EGO PLUS REGULAR** should be placed as shown in the image.\n- The white film peels from the tag and the adhesive is placed on the glass.\n- The bar coded side of the tag should be visible from inside the vehicle.\n- The **EGO PLUS REGULAR** EZ Tag is the most commonly issued tag. This tag is free of charge for the first eight (8) vehicles on an account.\n\n{page : 53}------------------------------------------------\n\n- A new tag purchase would be required for new windshields, new vehicles, or if removed for *ANY* reason.\nThe verbiage below should be referenced when explaining details to EZ TAG customers:\n\n*\"The EGO PLUS REGULAR has an embedded chip. The removal of a tag from the windshield will damage this chip. For this reason, the vendor does not warrant the performance of a tag if removed from the windshield for ANY reason\".*\n\n# **EGO PLUS MOTORCYCLE**\n\n- If a motorcycle tag is required, be sure to select Transponder Type \"**EGO PLUS MOTORCYCLE**\" in RITE.\n- The motorcycle EZ TAG can be placed anywhere on the bike or rider as they ride.\n- While the hard exterior of the tag makes it transferable, the license plate assigned to it **must** match the motorcycle using the tag.\n- Motorcycle EZ TAGs can only be assigned to motorcycle style vehicles.\n\n# **EGO PLUS LICENSE PLATE**\n\n{page : 54}------------------------------------------------\n\n- This tag is exclusively made for vehicles known to have trouble using the EGO PLUS REGULAR tag.\n- This tag mounts outside of the vehicle on the **FRONT** license plate.\n- This tag is only to be offered for vehicles on the \"**License Plate Tag**\" list. o For listed vehicles, CSRs must select \"**EGO PLUS LICENSE PLATE**\" when ordering.\n- CSRs must get Lead approval to order license plate EZ TAGs for vehicles that are not on the list.\n- Eligible customers may decline the License Plate Tag, but they must be educated that they will be responsible for the cost of replacing a non-functioning EZ TAG.\n\n*While the hard exterior of the tag makes it transferable, the license plate assigned to it must match",
    "chunk_order_index": 14,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-474719a2f3fb6bad15cc5be98356c335": {
    "tokens": 1200,
    "content": "**\" list. o For listed vehicles, CSRs must select \"**EGO PLUS LICENSE PLATE**\" when ordering.\n- CSRs must get Lead approval to order license plate EZ TAGs for vehicles that are not on the list.\n- Eligible customers may decline the License Plate Tag, but they must be educated that they will be responsible for the cost of replacing a non-functioning EZ TAG.\n\n*While the hard exterior of the tag makes it transferable, the license plate assigned to it must match the vehicle using the tag.*\n\n# *Please refer to the \"License Plate Tag\" list in your folder.*\n\n# **EZ TAG Cost**\n\n# **Total Amount of tag fee(s) + Prepaid Deposit = Account opening cost.**\n\n*Sticker EZ Tags * First eight (8) $0.00. Each additional tag after that costs $2.00*\n\nExample: *How much will a new EZ TAG account be with two (2) vehicles?*\n\nTag Fee $0.00 + Minimum Balance $10.00 = **$10.00** \n\nHow much would the account opening cost be for:\n\n- ➢ Three (3) vehicles?\n- ➢ Five (5) vehicles and One (1) motorcycle?\n- ➢ Eight (8) vehicles?\n\n{page : 55}------------------------------------------------\n\n## **Toll Rates by Vehicle Class**\n\n#### EZ Tag Benefit Discount\n\n- The HCTRA EZ TAG Benefit went into effect Labor Day 2023\n- HCTRA EZ TAG customers automatically receive the lowest rate with an active EZ TAG. However, under new policy approved by the Harris County Commissioners Court on January 31, 2023, HCTRA EZ TAG customers who drive a two-axle vehicle with a transponder will receive an additional 10% discount on HCTRA toll roads. Transactions on the Katy Managed Lanes will not receive the additional discount.\n- The HCTRA EZ TAG Benefit will only work for EZ TAG customers on HCTRA toll roads, except for Katy Managed Lanes. Interoperable customers with tags from other tolling agencies will not receive the additional discount*.*\n\n# **EZ TAG Features**\n\n## **Tagless Feature**\n\nAfter a customer orders an EZ TAG, they may use the EZ TAG lanes immediately until they pick up or activate their EZ TAG.\n\n- This Tagless feature is good for 45 days or until they activate their tag.\n- Tolls are charged at the cash rate.\n- The Tagless feature covers all vehicles awaiting an EZ TAG.\n\n*Note: Tagless Feature does not extend to Kansas and Oklahoma.*\n\n# **EZ PLATE**\n\nThe option for customers who need to add a vehicle temporarily is called EZ Plate. EZ Plate vehicles must adhere to the following rules:\n\n- EZ Plate customers are charged non-discounted, rates.\n\n{page : 56}------------------------------------------------\n\n- EZ Plate vehicles require **no** EZ TAG purchase. The system reads the license plate, and then deducts the tolls from the EZ TAG Account.\n- Three (3) EZ Plate vehicles can be on the account at one time.\n- An EZ Plate will count as an additional vehicle, which may increase the rebill amount.\n- EZ Plate vehicles can be added to a customer's account for up to seven (7) years.\n- The seven (7) year timeframe is for internal use only.\n\t- o HCTRA recommends a customer purchase a tag for a vehicle with long-term or repeated toll usage.\n\t- o This is so the customer may enjoy the discounted rates and interoperability.\n\n*Note: Ez Plate Courtesy does not extend to Kansas and Oklahoma.*\n\n# **Trailer Options Overview**\n\nTrailers may accumulate violations due to various reasons.\n\nPlease review the trailer options in this module to determine the best option for the customer\n\n# **Trailer driven less than 50% of the time:**\n\n- Add the trailer plate as an EZ Plate. Example: U-Haul moving truck.\n- Explain EZ Plate rules to the customer.\n\n# **Trailer pulled more than 50% of the time:**\n\n- Add the trailer license plate to the account by ordering a new EZ TAG. The customer will not place the tag on a windshield; instead, the customer must keep the EZ TAG in a safe place.\n\n{page : 57}------------------------------------------------\n\n# **EZ TAG Account Descriptions**\n\n# **EZ TAG APP: Traditional EZ TAG Accounts**\n\nTraditional EZ TAG account holders can manage their prefunded account at www.hctra.org or by\n\ndownloading the EZ TAG app.\n\n# **EZ TAG account holders can**:\n\n- Open an account\n- View their account balance and add funds to their account\n- Manage payment methods and view transactions\n- Manage vehicles\n- Call for HCTRA's roadside assistance\n- Receive push notifications and alerts\n- Customers are unable to view violation information at this time.\n\t- o Suspended accounts are redirected to [www.hctra.org.](http://www.hctra.org/)\n- Customers are able to close the account via the app.\n\n## *Note: For customers to view violation information, they must visit [www.hctra.org.](http://www.hctra.org/)*\n\n# **EZ TAG Express Accounts**\n\nPrepaid accounts opened by a customer via the EZ TAG Express mobile app. Tolls are paid by reading the plate.\n\n- No physical EZ TAG on the account.\n- Only one Active vehicle allowed at a time.\n- Customer can only access account via the mobile app.\n- Transactions are charged at the non-discounted rate.\n- Customer will not receive printed statements or letters.\n- Authorized contacts cannot be added.\n- These are auto-charged accounts with a $20 minimum. Credit card is the only payment option.\n- The app will automatically default to a seven (7) day timeframe when adding a license plate. The customer may select a different end date.\n- EZ Tag Express Account holders can close",
    "chunk_order_index": 15,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-c8329b539fb119d1a84a86d45f0929c4": {
    "tokens": 1200,
    "content": ".\n- Customer can only access account via the mobile app.\n- Transactions are charged at the non-discounted rate.\n- Customer will not receive printed statements or letters.\n- Authorized contacts cannot be added.\n- These are auto-charged accounts with a $20 minimum. Credit card is the only payment option.\n- The app will automatically default to a seven (7) day timeframe when adding a license plate. The customer may select a different end date.\n- EZ Tag Express Account holders can close their account via the app.\n- Do not edit driver's license, vehicle information or address on Ez TAG Express Accounts.\n\n*Note: EZ TAG Express account does not extend to Kansas and Oklahoma.*\n\n#### **Account View Screen**\n\n{page : 58}------------------------------------------------\n\n*Please reference \"TIP – EZ TAG Express Accounts\".*\n\n# **Identifying EZ TAG Express Accounts**\n\nThe following vehicle fields will be identical values for ALL EZ TAG Express accounts:\n\n- Year: 1999\n- Color: PLAID\n- Make: OTHER\n- Model: XYZ\n\n*NOTE: Do not make any changes to vehicle section. No transponder is required for vehicles on an EZ TAG Express account.*\n\n# **BancPass Account**\n\n#### **BancPass Facts:**\n\n- They **DO NOT** have an EZ TAG Account with HCTRA.\n- Works on any toll road in Texas.\n- BancPass tags are not transferable to an EZ TAG Account.\n- HCTRA can verify BancPass tag by Transponder ID (Agency \"HCTRA\") in both Account Search and Advanced Search screens.\n- BancPass customers can add funds to their account at any local HEB or anytime at bancpass.com.\n- Customers can manage their account with the BancPass phone app and automatic text balance reminders.\n- BancPass can be contacted at 866-978-5061, or customers can go to the BancPass website at www.bancpass.com\n\n# **Opening a New Account**\n\n{page : 59}------------------------------------------------\n\n# **Account Application**\n\nA customer can open an EZ TAG Account by doing one of the following:\n\n- Visiting a storefront location\n- Completing an application online by visiting [www.hctra.org](http://www.hctra.org/)\n- Via the EZ TAG mobile App\n- Via Mail or Fax\n- By contacting Customer Service at 281-875-3279\n\n# **Online EZ TAG Accounts**\n\nEZ TAG Accounts can be opened at [www.hctra.org.](http://www.hctra.org/) In addition to the personal information, online EZ TAG accounts require:\n\n- An email address\n- Username and password\n- Security Question and Answer (CSRs cannot see and/or alter the customer's security question)\n- The customer will receive an email from HCTRA describing the Tagless feature\n- The customer will be charged the minimum rebill amount based on the number of vehicles they added at opening ($20.00, 40.00, $80.00...etc.)\n- The tag fee(s)if applicable will be deducted from the account balance once the EZ TAG(s) is issued\n- Tags can be mailed or picked up at a store\n\n# **Before Opening an EZ TAG Account**\n\n#### **Call Center**\n\n- Advise the customer you will need their driver license number twice.\n\t- o Check for existing accounts.\n\t- o Input information in primary fields.\n- Check all license plates for violations.\n\t- o All violations must be addressed before opening the account.\n- Ensure the customer agrees to the account cost and future auto-charges.\n- Advise the customer to review their EZ TAG Agreement upon receipt.\n\n## **New Account Setup Wizard**\n\n- Opens all account types.\n- Offers \"breadcrumbs\" in case you have to go back.\n- If not completed, the account remains in \"Proposed\" status.\n\n{page : 60}------------------------------------------------\n\n# **Account View Screen** 1. Account Alerts\n\n- 2. Account Balance\n- 3. \"Edit\" account information\n- 4. Customer Online User ID\n- 5. Open Items\n- 6. Comments\n\nSome Account View screen edits require documentation.\n\n# *Note: Do not touch the Verify button under any circumstance.*\n\n# **Account Contact Information**\n\n- 1. **Telephone Information** primary and secondary phone numbers\n- 2. **Email Information** Select the email address and click \"Unmask\" to verify complete email address.\n- 3. **Billing Types** Debit/ Credit card or Bank account information\n- 4. **Account Contacts** Account holder and authorized contact details\n\n# **Vehicles, Transponders and Inventory**\n\n- 5. **Vehicles** Lists all active and inactive vehicles on an account\n\n{page : 61}------------------------------------------------\n\n- 6. **Transponders and Inventory** Lists all Active, Inactive, Pending Activation, Returned and \"Lost in Mail\" transponders.\n\t- o By expanding both the Vehicles and Transponder and Inventory scrfeens, we can see which vehicle si linked to which Ez TAG(transponder).\n\n{page : 62}------------------------------------------------\n\n# **CSC Menu & Account Maintenance**\n\n## **CSC Menu**\n\n- The blue CSC menu is how we assist customers with all account types.\n- Only open one CSC screen while serving customers. This will reduce the risk of transaction mishaps and or errors.\n- The system only allows one CSR to update an account at a time.\n\t- o *Please remember to log out of Rite 2.0 when leaving your desk for breaks and lunches*\n\n#### **Account Search**\n\nAccount Search allows CSRs to search for an account using the following:\n\n- EZ TAG Account number (Account ID)\n- EZ TAG number (Transponder ID)\n- License Plate\n- Phone Number\n- Email address\n\n# *Note: CSRs can use the wildcard search by placing a % (percent sign)",
    "chunk_order_index": 16,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-e17dcdcb044d200c5999a3b83a079fad": {
    "tokens": 1200,
    "content": "to update an account at a time.\n\t- o *Please remember to log out of Rite 2.0 when leaving your desk for breaks and lunches*\n\n#### **Account Search**\n\nAccount Search allows CSRs to search for an account using the following:\n\n- EZ TAG Account number (Account ID)\n- EZ TAG number (Transponder ID)\n- License Plate\n- Phone Number\n- Email address\n\n# *Note: CSRs can use the wildcard search by placing a % (percent sign) in alphanumeric fields only while locating the customer's account.*\n\n## **Advanced Search**\n\nThis feature is used to search for accounts using advanced criteria, such as invoice numbers, payment dates and transactions.\n\n#### **Streamlined Account Setup**\n\n- Quick way to open personal EZ TAG Accounts\n- Only use if given permission\n\n#### **New Account Setup**\n\n- Set up all EZ TAG Account types and plans\n- Remember to use the breadcrumbs to revisit any entered information\n\n## **Account Management expands into**\n\n- Account Maintenance\n- Account Actions\n\n#### **Account Maintenance**\n\n- Account History is used to get information about:\n\t- o *Payments*\n\t- o *Receipts*\n\t- o *Tolls (Transactions)*\n\t- o *Notifications*\n\n{page : 63}------------------------------------------------\n\n*Important: When exploring payments, always be mindful of the \"Account Rebill\" and \"Payments\" subcategories.*\n\n# **Notifications**\n\n- HCTRA sends automated notices to the customer per their selected notification preference.\n- Displays the date, time and type of notification sent to the customer.\n- HCTRA **does not** send out text notification.\n- HCTRA **does not** notify customer before we auto-charge the account.\n\n# **What automated email messages do we send to customers?**\n\n## **Notifications sent by HCTRA**\n\n- Online changes were made\n- An automatic or online payment was made\n- Your statement is ready to be viewed\n- Unable to make an auto-charge\n\n# **Monthly Statements**\n\n- CSRs can give a customer their statements throughout the life of their account.\n\t- o Statements are available per month.\n\t- o A Yearly summary can also be provided to the customer Monthly and/or Yearly.\n\t- o Customers who require statements before 2017, contact your Lead.\n\t- o Do not use the \"Send to Email Vendor\" button for statements.\n- Customers may also access their statements online, but only up to 18 months.\n\n# **Comments**\n\n- Comments are used to document customer interactions.\n# **Notification Preferences**\n\n- HCTRA uses either email or letter via USPS (United States Postal Service).\n- HCTRA **does not** send out text notifications.\n\n# **Billing Preferences**\n\n- The screen displays billing methods and billing preferences.\n- To ensure future auto-charge, the primary method of payment **must** be dropped into billing preferences.\n\n# **Special Rate Class Association**\n\n- This screen displays all active vehicles and the transponders associated to the vehicle on one page.\n- This screen also displays Disabled Veteran class association\n\n{page : 64}------------------------------------------------\n\n## **Account Actions**\n\n- This drop-down is where we \"take action\" on an EZ TAG account.\n# **View Cart (Cart Summary)**\n\n- Payments can be performed on the account.\n## **Payments**\n\n- Any payment made in \"View Cart\" will go to the account balance\n\t- o The \"Transaction Type\" should always be on \"Add to Balance\"\n- CSRs can accept payment on an EZ TAG account for the rebill amount or higher\n- Always verify the amount being charged with the customer\n- Before requesting a transponder, verify that there is enough money in the account to cover the tag cost without prompting a rebill. If not, rebill the customer's account\n- Rebill the customer's account\n- Always offer to take payment if the customer has a negative balance or is getting close to their rebill ¼ balance\n- Always give a receipt in the storefront\n\n## **Vehicle/Transponder Transfer**\n\n- Allows you to transfer vehicles, EZ TAGs or both from one account to another.\n- Use the \"**Transfer Transponder and Vehicle**\" option unless otherwise instructed.\n\n*Use the \"Transfer Transponder and Vehicle\" option unless otherwise instructed.*\n\n# **Transferring EZ TAGs**\n\n- Inactive EZ TAGs and vehicles can be transferred. Please ensure they are activated after the transfer.\n- Active EZ TAGs require the completed \"Request to Change EZ TAG Account Status\" form.\n- The \"**Source**\" account is the account the vehicle/transponder is coming from.\n- The \"**Destination**\" account is the account the vehicle/transponder is going to. You will start the transfer process while this account is loaded.\n\n#### *Please refer to the \"Request to Change EZ TAG Account Status\" form.*\n\n#### **Fulfillment Request**\n\nFulfillment Request lists pending tag requests that have not been picked up or mailed out yet.\n\n- CSRs are able to change the delivery method of the tag request\n- CSRs may also process tag orders\n- CSRs may cancel tag orders\n\n# **Pending Fulfillment Request Alert**\n\n{page : 65}------------------------------------------------\n\n- CSRs are able to perform the same task as listed in the Fulfillment Request menu option\n#### **Pending Fulfillment Request Alert**\n\n- CSRs are able to perform the same task as listed in the Fulfillment Request menu option.\n#### **Auto-charge**\n\n- CSRs are able to change the customer's auto-charge amount.\n## **Comments**\n\nEach customer interaction should be documented by the CSR.\n\nComments should include:\n\n- Customer's name\n- Account number/license plate\n- Reason for the call/visit\n- Resolution\n- Education\n- No abbreviations\n- Please always include the reason for violations, if applicable.\n- Be sure that your comments are clear and represent the nature of the call/visit",
    "chunk_order_index": 17,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-bbe78f44e95095ef3b0095bb2d3477f4": {
    "tokens": 1200,
    "content": "fillment Request menu option.\n#### **Auto-charge**\n\n- CSRs are able to change the customer's auto-charge amount.\n## **Comments**\n\nEach customer interaction should be documented by the CSR.\n\nComments should include:\n\n- Customer's name\n- Account number/license plate\n- Reason for the call/visit\n- Resolution\n- Education\n- No abbreviations\n- Please always include the reason for violations, if applicable.\n- Be sure that your comments are clear and represent the nature of the call/visit.\n\n## **A Bad Comment would look like this:**\n\n\"CB 2818753279\n\ncust. ms williams\n\nnew sticker and credit card\n\nplate gbf2549 2017 aUDi\"\n\nThis note is not detailed therefore it is hard to figure out exactly what the CSR did and if they talked to someone authorized on the account and there is no way to confirm that they completed their call flow (i.e educated the customer, updated the entire account). We also do not abbreviate anything in our notes.\n\n## **A Good Comment would look like this:**\n\nA Good Comment would look like this:ACCOUNT#258964 John Doe called to order a new EZ Tag for the new vehicle: GBF2549 (TX) 2016 Black Audi R8. The customer updated credit card to visa ending in 0001 exp. Date 01/2030 and authorized rebill for $20.00.Educated customer on the tagless feature, for your protection, online access, tag fee, and tag activation process. The account is in good standings. No violations are showing at this time.\n\n***Noticed how this comment is more detailed with no abbreviations.*\n\n# **Advanced Search - DMV Search**\n\n#### **DMV Search is used to: DMV Search is not used to:**\n\n{page : 66}------------------------------------------------\n\n- Verify vehicle information\n- Verify ownership dates\n- Locate registered owner\n- Find a registered address\n- Search out-of-state license plates\n- Search temporary license plates\n- Search for toll violations / uninvoiced tolls\n\n#### **How to Perform a DMV Search**\n\n## **Advanced Search – DMV Records**\n\n- Enter the License Plate Number.\n- Select the License Plate State from the drop-down menu.\n- Once the license plate is returned by the system, select the applicable row and click **View DMV Record**.\n\n## **DMV Record Breakdown**\n\n#### **Flex Pay Account**\n\nFlex Pay Accounts are similar to traditional EZ TAG Accounts; however, this account gives customers flexible payment options - such as opting in/out of Auto-Replenishment.\n\n{page : 67}------------------------------------------------\n\nFlex Pay accounts can be opened in-store, or over the phone. Call Center agents will use the following script when creating Flex Pay accounts by phone:\n\n# *\"Mr./Mrs. Customer to establish your account by phone, a onetime payment using a credit card is needed to fund the account.\"*\n\nCustomers with Flex Pay Accounts will have the ability to manage their account via hctra.org or the traditional EZ TAG app.\n\nTo avoid receiving violations, Flex Pay Account **must** remain in good standing.\n\n# **Flex Pay Overview**\n\n- A Flex Pay account has the option of opting in/out of autocharge.\n- A Flex Pay account does not require a mailing address. If the customer requests to close their account, a mailing address is required for refund purposes.\n- A Flex Pay customer can save a payment method(s) to their account without opting in to autocharge.\n- A Flex Pay customer can make a one-time payment with their saved payment method or a different payment method.\n- If a Flex Pay account has not opted in for autocharge, the Low Balance will automatically be set to $5.\n- When the account balance falls below the Low Balance, an email will be sent encouraging the customer to add funds to their account.\n- If a Flex Pay account has received the Low Balance email and the balance drops below $0.00, an email will be sent informing the customer of their suspended account.\n- A Flex Pay account's prepaid/opening balance will follow the new payment structure: $10 for 1-2 vehicles.\n\n{page : 68}------------------------------------------------\n\n## **Credit Card Enforcement Programs**\n\n## **Suspicious Activity Alert**\n\nRITE will flag a customer's account as \"suspicious\" when:\n\n- An account has an excessive number of online (hctra.org) credit card payments, no matter the amount and no matter the card used, within a certain timeframe; or\n- There is an excessive number of unique credit cards that have been used or saved to the account.\n- Once a customer's account has been flagged for suspicious activity, they are immediately logged out of their online account and are no longer able to log in until the \"Suspicious Activity\" flag has been set to 'No'.\n\n*TIP – Suspicious Activity Alert*\n\n## **Excessive Credit Card Declines**\n\n- CSC Procedure- Excessive Credit Card Declines outlines a procedure on when a customer's credit card has reached the maximum number of declines.\n- Inform the customer they need to use a different payment method because there have been too many declines on their card.\n- If the customer is adamant about using their \"excessively declined\" card, transfer them to your management team for assistance.\n\n#### *CSC Procedure- Excessive Credit Card Declines*\n\n# **TIP – Credit Card Decline (\"Prevented\") Codes**\n\nHCTRA will now prevent the usage of credit cards that have received a particular decline code. These codes are referred to as \"Prevented\" in the RITE system. Once a credit card has been marked as \"Prevented\", that card can no longer be used to make payment anywhere in HCTRA's system (e.g., CSC, website, auto-charge, etc.).\n\n*TIP – Credit Card Decline (\"Prevented\") Codes*\n\n**Credit Card Enforcements Guide",
    "chunk_order_index": 18,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-868a3d8c433896779318c3021994640e": {
    "tokens": 1200,
    "content": "\") Codes**\n\nHCTRA will now prevent the usage of credit cards that have received a particular decline code. These codes are referred to as \"Prevented\" in the RITE system. Once a credit card has been marked as \"Prevented\", that card can no longer be used to make payment anywhere in HCTRA's system (e.g., CSC, website, auto-charge, etc.).\n\n*TIP – Credit Card Decline (\"Prevented\") Codes*\n\n**Credit Card Enforcements Guide**\n\n{page : 69}------------------------------------------------\n\n*Recently Implemented Credit Card Enforcements*\n\nCustomer Service Techniques & Phone Etiquette\n\n{page : 70}------------------------------------------------\n\n# **Verifying Information**\n\nWhen verifying information, please utilize the Military Alphabet to ensure correct data is being retrieved and updated. Keep clear and concise tone.\n\n# **Proper Hold Techniques**\n\n# **Incorrect Hold Procedures:**\n\n\"Hold please...\"\n\n\"Let me place you on hold real quick\" \"One moment ma'am/sir\"\n\n# **Proper Hold Procedure:**\n\n\"May I place you on hold Mr./Ms._____ while I research your account?\"\n\n# **After returning to the call:**\n\n\"Thank you for holding Mr./Ms. ______\"\n\n# **Account Verification**\n\n{page : 71}------------------------------------------------\n\n# **Beginning the Customer Contact- Call Center**\n\nThe call center greeting is intended to determine whether or the not the customer has an EZ TAG Account.\n\n# \"**Thank you for calling the Harris County Toll Road Authority. My name is___, may I have your account number or license plate number please?\"**\n\n(*Other options: DL#, Name, Phone#, or Invoice#, etc*.)\n\n*Always ask for the caller's name, even if they do not have an EZ TAG account.*\n\n## **Verifying EZ TAG Accounts - Call Center**\n\nAfter getting the caller's name and verifying if we can speak with them, use the call flow to verify the customer's EZ TAG Account.\n\n- \"I have accessed your account. May I have the email address on file?\"\n\t- o (If no email, the customer verifies the mailing address and then an email address is requested and updated, if applicable.)\n- \"We have your mailing address as _______. Is this information still correct?\"\n- Only verify credit card if it is within two (2) months of expiring, it is currently expired, or there has been an auto charge reject.\n- \"Has anything changed, including license plate numbers?\"\n- \"For a full listing of all of your vehicles, please visit our website at www.hctra.org\"\n\n## **Verifying Violator Accounts**\n\nWhen addressing a Violator Account, please be sure to verify the following information with the customer:\n\n- License plate number\n- The vehicle information (year, make, model, color)\n\n# *Please note: CSRs are required to ask customers with Violator accounts for their phone number and email address to add to the Violator account.*\n\n#### **Authorized Contacts**\n\nHCTRA's policy requires us to speak to the account holder, or the account holder's designated **\"Authorized Contact\" (Account Contact)** notated on the account. Please be sure the person is listed on the account prior to discussing anything regarding the account.\n\n- Account Holders **CAN** give verbal authorization to speak to a non authorized contact (as a one-time authorization)\n- Authorized Contacts **CANNOT** close the account\n- Authorized Contacts **CANNOT** be added over the phone without documentation\n- Authorized Contacts **CANNOT** add other contacts\n\n*Note: Please check for Authorized Contacts throughout the Account View Screen*\n\n# *HCTRA IVR*\n\n{page : 72}------------------------------------------------\n\nHCTRA released a new IVR (Interactive Voice Recognition) technology to enhance the customer experience.\n\nThe IVR system assists customers with following:\n\n- Customers can hear general information\n- Activating Pending EZ Tag(s)\n- Hear EZ Tag account balance\n- Resetting online access\n- Making a payment\n- Updating billing information\n\nCustomers with open unpaid balances will be able to\n\n- Hear balance owed\n- Make a payment\n\nCustomers can opt to transfer to a CSR at anytime. If it is outside of business hours the customer will need to call back\n\nWhat is not handled by IVR?\n\n# **Calls will be transferred to a CSR when:**\n\n- IVR cannot find or verify an account based on the customer's phone number and zip entered\n- Multiple accounts match caller phone number\n- Caller is seeking assistance outside the offered functions\n- Caller has outstanding **account fee(s) (e.g., NSF fee)**\n- Payment cannot be made with new bank account / EFT\n- Caller owes more than the IVR's threshold values (to avoid a timeout)\n- A payment is taking too long\n- Other unforeseen errors\n\n# **Verifying the caller –**\n\n- If the transferred call indicates successful authentication (\"authenticated=Y\") the CSR is only required to confirm the name on the account.\n- The CSR should assist the customer as they would any other caller, with the bonus of the IVR transfer providing caller intent details (what the customer was attempting to do)\n- Please reference TIP-HCTRA IVR for caller intent values\n\n# **Account Maintenance: Need to Know**\n\n# **Closing the Account**\n\n- The Account Holder may close their account online or submit a \"Request to Change Account Status\" form. Authorized Contacts may not close the account.\n- The account balance will be refunded to the payment method on file.\n\t- o Verify the payment method on file.\n\t- o Credit card refunds allow 3 5 business day.\n\t- o Check refunds allow 6 8 weeks.\n- Accounts with a negative balance status **cannot** be closed. Collect payment first.\n\n{page : 73}------------------------------------------------\n\n- Please educate customers that refund amounts are subject to change due to various reasons.\n- Closed EZ TAG Accounts cannot be re",
    "chunk_order_index": 19,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-bde8b434df7ef06fb90109d54ba1c320": {
    "tokens": 1200,
    "content": ".\n- The account balance will be refunded to the payment method on file.\n\t- o Verify the payment method on file.\n\t- o Credit card refunds allow 3 5 business day.\n\t- o Check refunds allow 6 8 weeks.\n- Accounts with a negative balance status **cannot** be closed. Collect payment first.\n\n{page : 73}------------------------------------------------\n\n- Please educate customers that refund amounts are subject to change due to various reasons.\n- Closed EZ TAG Accounts cannot be re-opened.\n- EZ TAGs associated with a closed account cannot be used or transferred.\n\n*Please refer to the \"Request to Change EZ TAG Account Status\" form.*\n\n# **Adding New Vehicle**\n\n**Important Facts**\n\n- **CHECK FOR VIOLATIONS** before adding the license plate to the account!\n- The customer must agree to resolve violations before a new EZ TAG is issued.\n- Verify the customer has enough available funds on the account to cover the cost of a new EZ TAG without being below the low-level balance.\n- The letters 'I' and 'O' are not standard issued Texas license plates. Please ask customers to verify if they mean the numbers '1' or '0'.\n- Temporary license plates will have all numbers and one letter. For example: \"09876B6\"\n\n# *Please refer to the TIP-Temporary License Checkbox*\n\n# **Vehicles Stuck in Proposed**\n\nA vehicle occasionally gets stuck in a proposed status when:\n\n- A CSR encounters the \"One Step check out failed\" error message when attempting to add a new vehicle tag.\n- A customer adds a vehicle to their account via www.hctra.org\n- When \"SAVE\" is not clicked when adding a vehicle\n\n# **Account Holder Name Change**\n\n# **The following changes require documentation**:\n\n- Driver's License, State ID, passport and/or other government issued identification\n- *Customers may choose to fax documents to 281-877-0402 or bring documentation to an EZ TAG storefront location.*\n\n# **Always advise customers to provide the following on their fax request:**\n\n- Name\n- Account Number(s)\n- Contact Number\n- Brief description of issue\n\n# *Faxes will be processed within 48 hours.*\n\n# **Note: All documentation must reflect the requested changes.*\n\n# **Changing Account Holders**\n\nDocumentation will be required in cases where a customer can no longer act on their own behalf. Examples include:\n\n- Death Certificates\n- Power of Attorney\n\n{page : 74}------------------------------------------------\n\n- Company Letterheads\nPlease contact your Lead for specific details.\n\n## **Important Information**\n\n- **Violations Indicator**: If seen on an active vehicle, we must discuss and notate those violations, even if the customer called for a different reason.\n- **Pending Activation Tags**: If you see \"Pending Activation\" next to an EZ TAG, always verify if the customer has the tag. Offer to activate the EZ TAG only if the customer has the tag.\n\n*Note: When updating a license plate, we must first make sure the customer has received and activated the transponder prior to making any changes to the vehicle information.*\n\n# **Back Office Accounts**\n\n## **Fleet or Invoiced**\n\nConfirm if the customer is:\n\n- An Account Contact\n- Has submitted a request to become a contact\n- Requesting to become a contact\n- Once confirmed, Call Center CSRs will transfer to 3223. Storefront will contact their Lead.\n\n# **Large Account**\n\nConfirm the customer's contact status as shown for Fleet or Invoiced\n\n- Verify if the customer's request is:\n\t- o Adding or removing vehicles\n\t\t- o Adding violations\n\t\t- o Multiple and/or time-consuming request\n- Once confirmed, Call Center CSRs will transfer to 3223. Storefront will contact their Lead.\n\n# *Note: Please check your section's criteria for what CSRs are allowed to perform with a large account.*\n\n# **Rental Cars & EZ TAG Accounts**\n\n- Most rental companies have toll tag accounts.\n- Customers may add rental vehicles to their EZ TAG Accounts as an EZ Plate. o Make sure to verify the jurisdiction of the plate\n- If a customer received an invoice from the rental company when the vehicle was on their EZ TAG Account, contact a Lead.\n- Customers are responsible for informing HCTRA of any changes to the projected end date.\n\n## *Note: Tolls will only post to the account after the vehicle has been added. Tolls that occurred prior to adding the vehicle must be addressed separately.*\n\n# **Rental Cars & Violations**\n\n- If a customer used a rental car on the tollway and wants to pay the toll, check the license in Account Search.\n\t- o If the vehicle is on an EZ TAG Account, the customer must contact their rental agency. We cannot accept payment.\n\t- o If the vehicle does not appear on an EZ TAG Account, the customer may pay the toll with the CSR or pay at [www.hctra.org.](http://www.hctra.org/)\n\n{page : 75}------------------------------------------------\n\n- If a customer received an invoice from a rental agency and the vehicle was not on the customer's EZ TAG Account, they must contact the rental agency.\n*Note: Remember, do not notate fleet accounts. Transfer to 3223.*\n\nIf the vehicle's end date has expired based on the military ID expiration date, the customer must present a current military ID at a storefront location.\n\n{page : 76}------------------------------------------------\n\n# **Checking for Violations**\n\n# **When to Check For Violations**\n\n#### **Within an Account**\n\n- Anytime we locate an EZ TAG Account, we need to check the first five (5) active vehicles on the account.\n- Cross Account History is used to check for additional violations in both EZ TAG and Violator accounts.\n\n## *Please refer to the \"TIP - Active Vehicle Review\" handout.*\n\n# **When Adding a",
    "chunk_order_index": 20,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-cc58897cc3aac6e23122c6edc492e421": {
    "tokens": 1200,
    "content": "a storefront location.\n\n{page : 76}------------------------------------------------\n\n# **Checking for Violations**\n\n# **When to Check For Violations**\n\n#### **Within an Account**\n\n- Anytime we locate an EZ TAG Account, we need to check the first five (5) active vehicles on the account.\n- Cross Account History is used to check for additional violations in both EZ TAG and Violator accounts.\n\n## *Please refer to the \"TIP - Active Vehicle Review\" handout.*\n\n# **When Adding a Vehicle**\n\nCheck for violations when:\n\n- Ordering a New EZ TAG\n\t- o Make sure to verify the jurisdiction of the plate.\n- Adding an EZ Plate\n\t- o Make sure to verify the jurisdiction of the plate.\n- Updating a license plate\n- Activating an EZ TAG\n- Opening a new EZ TAG account\n\n*Once paid, ensure the vehicle on the Violator account has been end dated before adding to an EZ TAG account.*\n\n#### **How to Check For Violations**\n\nThere are two ways to check for violations:\n\n- Account Search in the license plate and/or invoice field.\n- Advanced Search in the transaction field.\n\t- o Always select \"Open\" under transaction status.\n\n## **Reasons for Violations**\n\n- Customer failed to add the vehicle to the account.\n- The account did not have funds at the time of toll usage (auto-charge reject, credit card expired, or no payment method is on file).\n- Customer failed to update the license plate for a vehicle on the account.\n- Please reference the How to Remove Expiry Date TIP.\n- Customer failed to activate EZ TAG before the Tagless feature expired.\n- Vehicle and transponder were not saved properly (proposed vehicles).\n\n#### *IMPORTANT: EZ TAG Accounts can only rebill AFTER the customer resolves their violation issues.*\n\n{page : 77}------------------------------------------------\n\n# **Determining When An Account Went Negative**\n\nIf a customer has a negative EZ Tag account balance, the want to know when and why it happened. Here are a few ways to determine when the account negative:\n\n- Check Notifications\n- Check Comments\n- Check Account Alerts\n- Check Statements\n- Check Receipts\n- Check Financial History\n\n## **Pay Using EZ Tag Account**\n\n## **CSRs are able to take payment for a Violator account from an EZ TAG account!**\n\n- Anything added to the Violator account Cart (Uninvoiced, Fee reduction, adjustments, etc.) can be paid using an EZ TAG account.\n- If the EZ TAG account's balance is not enough to cover the payment and/or the balance will fall below the account's low balance, the system will calculate the required amount and prompt for that payment.\n- The vehicle on the Violator account may be available to transfer to the EZ TAG account. Ensure all of the vehicle information is complete before requesting an Ez TAG for the vehicle.\n- A vehicle that has already been End Dated on the Violator account will not transfer. The ability to transfer an End Dated vehicle will be a future enhancement.\n- Partial payment is allowed.\n- Do not transfer a vehicle to an Express account.\n\n#### *TIP – Pay Using EZ Tag Account*\n\n# **Toll Credits/Adjustments**\n\n#### **Toll Credits/ Adjustments may be performed for the following reasons:**\n\n- Toll Credits DMV error, duplicate plate issue, emergency vehicles (as requested by Incident Management)\n- Class Mismatch Axle count reclassification (e.g., 4 vs. 3)\n- Toll Rate Overcharge Adjustments Customer was charged wrong rate (e.g., cash vs. tag)\n- IOP Toll Credits\n\t- Full toll credit\n\t- Partial toll credit (by processing a Class Mismatch)\n\n# **Fee Reduction/Toll Adjustment**\n\n- License plates that have escalated to collections do not qualify for the Fee Reduction Program.\n- BCTRA and BTG invoices are not eligible for the Fee Reduction program.\n- EZTAG customers qualify for two (2) Fee Reductions within a 365-day period.\n- o EZTAG customers with multiple license plates qualify for a fee reduction for each plate\n- Non-EZTAG customers will only qualify for one (1) Fee Reduction within a 365-day period.\n\n{page : 78}------------------------------------------------\n\nUnder the Fee Reduction Program, customers who are EZTAG/EZ Express customers or those who opt to open an EZTAG account are eligible to have toll charges, starting from September 4, 2023, adjusted from the invoiced amount to the pre-invoiced amount. For instance, a toll charge of $3.00 can be adjusted to $1.80.\n\n# **Steps**\n\nFrom the *CSC* menu\n\n➢ Select the Account Maintenance menu\n\nClick Account Toll Adjustments\n\nEnter the information below on the *Account Toll Adjustments* bubble\n\n- Transaction Date From\n- Transaction Date To\n- Transaction Authority\n- License Plate Number\n- License Plate State\n- Select Toll Violation Invoices in the Invoice Type section\n\t- Fill in the missing information in the *Comments* section\n\t- Example: Account number 6294214649\n\t- License plate number GV64DK TX\n\t- Customer Name AYENI, KOREDE DANIEL\n\t- Adjustment Type Toll Overcharge\n\t- Detailed Reason for Adjustment Customer qualifies for FRP and agreed to open EZTAG account.\n\t- Amount Due Before Adjustment: $49.29 ( 39.29 toll+10.00 EIN Fee)\n\t- Total amount adjusted: -$13.44 (tolls)\n\t- Remaining Balance Due: $35.85 ($29.29 (tolls total including uninvoiced) + $10.00 (EIN Fee)).\n- Click Yes on the pop-up window\n- Click Submit\n- Return to the *Open Items* screen and proceed with the Fee Reduction.\n- In the *Excuse* window",
    "chunk_order_index": 21,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  },
  "chunk-ab413a9398713b9534c556f4387bf2aa": {
    "tokens": 150,
    "content": ".29 ( 39.29 toll+10.00 EIN Fee)\n\t- Total amount adjusted: -$13.44 (tolls)\n\t- Remaining Balance Due: $35.85 ($29.29 (tolls total including uninvoiced) + $10.00 (EIN Fee)).\n- Click Yes on the pop-up window\n- Click Submit\n- Return to the *Open Items* screen and proceed with the Fee Reduction.\n- In the *Excuse* window deselect \"Add Fee Reduction program convenience fee ($5.00)\"\n- Proceed to complete the transaction by processing the payment\n\nAdd comments box for FRP. Example below\n\n{page : 79}------------------------------------------------\n\n{page : 80}------------------------------------------------",
    "chunk_order_index": 22,
    "full_doc_id": "doc-d73fe18fb13de4576b6de707c19166c7"
  }
}